; ModuleID = 'extracted.c'
source_filename = "extracted.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [2 x i32]*, i32*, %struct.ctl_value*, [16 x i32]*, [0 x i32]* }
%struct.ctl_value = type { %union.anon }
%union.anon = type { i64 }
%struct.anon.0 = type { [1 x i32]*, %struct.vip_definition*, %struct.vip_meta*, [512 x i32]*, [0 x i32]* }
%struct.vip_definition = type { %union.anon.1, i16, i8 }
%union.anon.1 = type { [4 x i32] }
%struct.vip_meta = type { i32, i32 }
%struct.anon.2 = type { [12 x i32]*, [4 x i32]*, [4 x i32]*, [128 x i32]*, [0 x i32]* }
%struct.anon.3 = type { [9 x i32]*, %struct.flow_key*, %struct.real_pos_lru*, [1000 x i32]*, [0 x i32]* }
%struct.flow_key = type { %union.anon.4, %union.anon.5, %union.anon.6, i8 }
%union.anon.4 = type { [4 x i32] }
%union.anon.5 = type { [4 x i32] }
%union.anon.6 = type { i32 }
%struct.real_pos_lru = type { i32, i64 }
%struct.anon.7 = type { [2 x i32]*, i32*, i32*, [33554944 x i32]*, [0 x i32]* }
%struct.anon.8 = type { [2 x i32]*, i32*, %struct.real_definition*, [4096 x i32]*, [0 x i32]* }
%struct.real_definition = type { %union.anon.9, i8 }
%union.anon.9 = type { [4 x i32] }
%struct.anon.10 = type { [6 x i32]*, i32*, %struct.lb_stats*, [4096 x i32]*, [0 x i32]* }
%struct.lb_stats = type { i64, i64 }
%struct.anon.11 = type { [6 x i32]*, i32*, %struct.lb_stats*, [1024 x i32]*, [0 x i32]* }
%struct.anon.12 = type { [2 x i32]*, i32*, i32*, [16777214 x i32]*, [0 x i32]* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 958, type: !337, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !73, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "extracted.c", directory: "/home/sayandes/codequery/extraction")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 3112, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./bpf.h", directory: "/home/sayandes/codequery/extraction")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!41 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!42 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!43 = !{!44, !45, !46, !49, !50, !64, !69, !70, !72}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !47, line: 24, baseType: !48)
!47 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quic_long_header", file: !52, line: 41, size: 112, elements: !53)
!52 = !DIFile(filename: "./pckt_parsing.h", directory: "/home/sayandes/codequery/extraction")
!53 = !{!54, !57, !59, !60}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !51, file: !52, line: 42, baseType: !55, size: 8)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !47, line: 21, baseType: !56)
!56 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !51, file: !52, line: 43, baseType: !58, size: 32, offset: 8)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !47, line: 27, baseType: !7)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "conn_id_lens", scope: !51, file: !52, line: 46, baseType: !55, size: 8, offset: 40)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "dst_connection_id", scope: !51, file: !52, line: 50, baseType: !61, size: 64, offset: 48)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 64, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 8)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quic_short_header", file: !52, line: 53, size: 72, elements: !66)
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !52, line: 54, baseType: !55, size: 8)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "connection_id", scope: !65, file: !52, line: 55, baseType: !61, size: 64, offset: 8)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !71, line: 53, baseType: !7)
!71 = !DIFile(filename: "./jhash.h", directory: "/home/sayandes/codequery/extraction")
!72 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!73 = !{!0, !74, !112, !150, !169, !211, !224, !246, !262, !275, !288, !298, !314, !320, !325, !327, !332}
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "ctl_array", scope: !2, file: !76, line: 41, type: !77, isLocal: false, isDefinition: true)
!76 = !DIFile(filename: "./control_data_maps.h", directory: "/home/sayandes/codequery/extraction")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !76, line: 35, size: 320, elements: !78)
!78 = !{!79, !84, !86, !102, !107}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !77, file: !76, line: 36, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 64, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 2)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !77, file: !76, line: 37, baseType: !85, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !77, file: !76, line: 38, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_value", file: !89, line: 53, size: 64, elements: !90)
!89 = !DIFile(filename: "./balancer_structs.h", directory: "/home/sayandes/codequery/extraction")
!90 = !{!91}
!91 = !DIDerivedType(tag: DW_TAG_member, scope: !88, file: !89, line: 54, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !88, file: !89, line: 54, size: 64, elements: !93)
!93 = !{!94, !97, !98}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !92, file: !89, line: 55, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !47, line: 31, baseType: !96)
!96 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !92, file: !89, line: 56, baseType: !58, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !92, file: !89, line: 57, baseType: !99, size: 48)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 48, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 6)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !77, file: !76, line: 39, baseType: !103, size: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 512, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 16)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !77, file: !76, line: 40, baseType: !108, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 0)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "vip_map", scope: !2, file: !114, line: 38, type: !115, isLocal: false, isDefinition: true)
!114 = !DIFile(filename: "./balancer_maps.h", directory: "/home/sayandes/codequery/extraction")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 32, size: 320, elements: !116)
!116 = !{!117, !122, !138, !144, !149}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !115, file: !114, line: 33, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 1)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !115, file: !114, line: 34, baseType: !123, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vip_definition", file: !89, line: 62, size: 160, elements: !125)
!125 = !{!126, !136, !137}
!126 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !89, line: 63, baseType: !127, size: 128)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !89, line: 63, size: 128, elements: !128)
!128 = !{!129, !132}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !127, file: !89, line: 64, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !131, line: 27, baseType: !58)
!131 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!132 = !DIDerivedType(tag: DW_TAG_member, name: "vipv6", scope: !127, file: !89, line: 65, baseType: !133, size: 128)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 128, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 4)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !124, file: !89, line: 67, baseType: !46, size: 16, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !124, file: !89, line: 68, baseType: !55, size: 8, offset: 144)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !115, file: !114, line: 35, baseType: !139, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vip_meta", file: !89, line: 72, size: 64, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !140, file: !89, line: 73, baseType: !58, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "vip_num", scope: !140, file: !89, line: 74, baseType: !58, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !115, file: !114, line: 36, baseType: !145, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 16384, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !115, file: !114, line: 37, baseType: !108, size: 64, offset: 256)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "lru_mapping", scope: !2, file: !114, line: 47, type: !152, isLocal: false, isDefinition: true)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 41, size: 320, elements: !153)
!153 = !{!154, !159, !162, !163, !168}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !152, file: !114, line: 42, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 384, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 12)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !152, file: !114, line: 43, baseType: !160, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 128, elements: !134)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !152, file: !114, line: 44, baseType: !160, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !152, file: !114, line: 45, baseType: !164, size: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 4096, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !152, file: !114, line: 46, baseType: !108, size: 64, offset: 256)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "fallback_cache", scope: !2, file: !114, line: 56, type: !171, isLocal: false, isDefinition: true)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 50, size: 320, elements: !172)
!172 = !{!173, !178, !199, !205, !210}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !171, file: !114, line: 51, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 288, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 9)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !171, file: !114, line: 52, baseType: !179, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_key", file: !89, line: 26, size: 320, elements: !181)
!181 = !{!182, !187, !192, !198}
!182 = !DIDerivedType(tag: DW_TAG_member, scope: !180, file: !89, line: 27, baseType: !183, size: 128)
!183 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !180, file: !89, line: 27, size: 128, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !183, file: !89, line: 28, baseType: !130, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "srcv6", scope: !183, file: !89, line: 29, baseType: !133, size: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, scope: !180, file: !89, line: 31, baseType: !188, size: 128, offset: 128)
!188 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !180, file: !89, line: 31, size: 128, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !188, file: !89, line: 32, baseType: !130, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "dstv6", scope: !188, file: !89, line: 33, baseType: !133, size: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, scope: !180, file: !89, line: 35, baseType: !193, size: 32, offset: 256)
!193 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !180, file: !89, line: 35, size: 32, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ports", scope: !193, file: !89, line: 36, baseType: !58, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "port16", scope: !193, file: !89, line: 37, baseType: !197, size: 32)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !82)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !180, file: !89, line: 39, baseType: !55, size: 8, offset: 288)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !171, file: !114, line: 53, baseType: !200, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_pos_lru", file: !89, line: 78, size: 128, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !201, file: !89, line: 79, baseType: !58, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !201, file: !89, line: 80, baseType: !95, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !171, file: !114, line: 54, baseType: !206, size: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32000, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 1000)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !171, file: !114, line: 55, baseType: !108, size: 64, offset: 256)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "ch_rings", scope: !2, file: !114, line: 65, type: !213, isLocal: false, isDefinition: true)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 59, size: 320, elements: !214)
!214 = !{!215, !216, !217, !218, !223}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !114, line: 60, baseType: !80, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !213, file: !114, line: 61, baseType: !85, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !213, file: !114, line: 62, baseType: !85, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !213, file: !114, line: 63, baseType: !219, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 1073758208, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 33554944)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !213, file: !114, line: 64, baseType: !108, size: 64, offset: 256)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "reals", scope: !2, file: !114, line: 74, type: !226, isLocal: false, isDefinition: true)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 68, size: 320, elements: !227)
!227 = !{!228, !229, !230, !240, !245}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !226, file: !114, line: 69, baseType: !80, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !226, file: !114, line: 70, baseType: !85, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !226, file: !114, line: 71, baseType: !231, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_definition", file: !89, line: 84, size: 160, elements: !233)
!233 = !{!234, !239}
!234 = !DIDerivedType(tag: DW_TAG_member, scope: !232, file: !89, line: 85, baseType: !235, size: 128)
!235 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !232, file: !89, line: 85, size: 128, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !235, file: !89, line: 86, baseType: !130, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "dstv6", scope: !235, file: !89, line: 87, baseType: !133, size: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !232, file: !89, line: 89, baseType: !55, size: 8, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !226, file: !114, line: 72, baseType: !241, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 131072, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 4096)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !226, file: !114, line: 73, baseType: !108, size: 64, offset: 256)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "reals_stats", scope: !2, file: !114, line: 83, type: !248, isLocal: false, isDefinition: true)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 77, size: 320, elements: !249)
!249 = !{!250, !253, !254, !260, !261}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !248, file: !114, line: 78, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 192, elements: !100)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !248, file: !114, line: 79, baseType: !85, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !248, file: !114, line: 80, baseType: !255, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lb_stats", file: !89, line: 93, size: 128, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !256, file: !89, line: 94, baseType: !95, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !256, file: !89, line: 95, baseType: !95, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !248, file: !114, line: 81, baseType: !241, size: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !248, file: !114, line: 82, baseType: !108, size: 64, offset: 256)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "stats", scope: !2, file: !114, line: 92, type: !264, isLocal: false, isDefinition: true)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 86, size: 320, elements: !265)
!265 = !{!266, !267, !268, !269, !274}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !264, file: !114, line: 87, baseType: !251, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !264, file: !114, line: 88, baseType: !85, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !264, file: !114, line: 89, baseType: !255, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !264, file: !114, line: 90, baseType: !270, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32768, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 1024)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !264, file: !114, line: 91, baseType: !108, size: 64, offset: 256)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "server_id_map", scope: !2, file: !114, line: 102, type: !277, isLocal: false, isDefinition: true)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 96, size: 320, elements: !278)
!278 = !{!279, !280, !281, !282, !287}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !277, file: !114, line: 97, baseType: !80, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !277, file: !114, line: 98, baseType: !85, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !277, file: !114, line: 99, baseType: !85, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !277, file: !114, line: 100, baseType: !283, size: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 536870848, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 16777214)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !277, file: !114, line: 101, baseType: !108, size: 64, offset: 256)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "flow_debug_maps", scope: !2, file: !290, line: 31, type: !291, isLocal: false, isDefinition: true)
!290 = !DIFile(filename: "./flow_debug_maps.h", directory: "/home/sayandes/codequery/extraction")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 25, size: 320, elements: !292)
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !291, file: !290, line: 26, baseType: !155, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !291, file: !290, line: 27, baseType: !160, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !291, file: !290, line: 28, baseType: !160, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !291, file: !290, line: 29, baseType: !164, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !291, file: !290, line: 30, baseType: !108, size: 64, offset: 256)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "decap_counters", scope: !2, file: !300, line: 44, type: !301, isLocal: false, isDefinition: true)
!300 = !DIFile(filename: "./decap_maps.h", directory: "/home/sayandes/codequery/extraction")
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !300, line: 38, size: 320, elements: !302)
!302 = !{!303, !304, !305, !312, !313}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !301, file: !300, line: 39, baseType: !251, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !301, file: !300, line: 40, baseType: !85, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !301, file: !300, line: 41, baseType: !306, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decap_stats", file: !300, line: 31, size: 192, elements: !308)
!308 = !{!309, !310, !311}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "decap_v4", scope: !307, file: !300, line: 32, baseType: !95, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "decap_v6", scope: !307, file: !300, line: 33, baseType: !95, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !307, file: !300, line: 34, baseType: !95, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !301, file: !300, line: 42, baseType: !270, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !301, file: !300, line: 43, baseType: !108, size: 64, offset: 256)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !316, line: 22, type: !317, isLocal: true, isDefinition: true)
!316 = !DIFile(filename: "./bpf_helpers.h", directory: "/home/sayandes/codequery/extraction")
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!44, !44, !44}
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "bpf_get_smp_processor_id", scope: !2, file: !316, line: 47, type: !322, isLocal: true, isDefinition: true)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!96}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !316, line: 41, type: !322, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !316, line: 24, type: !329, isLocal: true, isDefinition: true)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!72, !44, !44, !44, !96}
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "bpf_xdp_adjust_head", scope: !2, file: !316, line: 91, type: !334, isLocal: true, isDefinition: true)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!72, !44, !72}
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 32, elements: !134)
!338 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!339 = !{i32 7, !"Dwarf Version", i32 4}
!340 = !{i32 2, !"Debug Info Version", i32 3}
!341 = !{i32 1, !"wchar_size", i32 4}
!342 = !{!"clang version 10.0.0-4ubuntu1 "}
!343 = distinct !DISubprogram(name: "balancer_ingress", scope: !3, file: !3, line: 934, type: !344, scopeLine: 934, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !354)
!344 = !DISubroutineType(types: !345)
!345 = !{!72, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 3123, size: 160, elements: !348)
!348 = !{!349, !350, !351, !352, !353}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !347, file: !6, line: 3124, baseType: !58, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !347, file: !6, line: 3125, baseType: !58, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !347, file: !6, line: 3126, baseType: !58, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !347, file: !6, line: 3128, baseType: !58, size: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !347, file: !6, line: 3129, baseType: !58, size: 32, offset: 128)
!354 = !{!355, !356, !357, !358, !368, !369}
!355 = !DILocalVariable(name: "ctx", arg: 1, scope: !343, file: !3, line: 934, type: !346)
!356 = !DILocalVariable(name: "data", scope: !343, file: !3, line: 935, type: !44)
!357 = !DILocalVariable(name: "data_end", scope: !343, file: !3, line: 936, type: !44)
!358 = !DILocalVariable(name: "eth", scope: !343, file: !3, line: 937, type: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !361, line: 163, size: 112, elements: !362)
!361 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!362 = !{!363, !365, !366}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !360, file: !361, line: 164, baseType: !364, size: 48)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 48, elements: !100)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !360, file: !361, line: 165, baseType: !364, size: 48, offset: 48)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !360, file: !361, line: 166, baseType: !367, size: 16, offset: 96)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !131, line: 25, baseType: !46)
!368 = !DILocalVariable(name: "eth_proto", scope: !343, file: !3, line: 938, type: !58)
!369 = !DILocalVariable(name: "nh_off", scope: !343, file: !3, line: 939, type: !58)
!370 = !DILocalVariable(name: "new_dst_lru", scope: !371, file: !3, line: 455, type: !201)
!371 = distinct !DISubprogram(name: "get_packet_dst", scope: !3, file: !3, line: 448, type: !372, scopeLine: 453, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !383)
!372 = !DISubroutineType(types: !373)
!373 = !{!374, !375, !376, !139, !374, !44}
!374 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_description", file: !89, line: 43, size: 384, elements: !378)
!378 = !{!379, !380, !381, !382}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !377, file: !89, line: 44, baseType: !180, size: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "real_index", scope: !377, file: !89, line: 45, baseType: !58, size: 32, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !377, file: !89, line: 46, baseType: !55, size: 8, offset: 352)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !377, file: !89, line: 48, baseType: !55, size: 8, offset: 360)
!383 = !{!384, !385, !386, !387, !388, !370, !389, !390, !391, !392, !393, !394, !395}
!384 = !DILocalVariable(name: "real", arg: 1, scope: !371, file: !3, line: 449, type: !375)
!385 = !DILocalVariable(name: "pckt", arg: 2, scope: !371, file: !3, line: 450, type: !376)
!386 = !DILocalVariable(name: "vip_info", arg: 3, scope: !371, file: !3, line: 451, type: !139)
!387 = !DILocalVariable(name: "is_ipv6", arg: 4, scope: !371, file: !3, line: 452, type: !374)
!388 = !DILocalVariable(name: "lru_map", arg: 5, scope: !371, file: !3, line: 453, type: !44)
!389 = !DILocalVariable(name: "under_flood", scope: !371, file: !3, line: 456, type: !374)
!390 = !DILocalVariable(name: "src_found", scope: !371, file: !3, line: 457, type: !374)
!391 = !DILocalVariable(name: "real_pos", scope: !371, file: !3, line: 458, type: !85)
!392 = !DILocalVariable(name: "cur_time", scope: !371, file: !3, line: 459, type: !95)
!393 = !DILocalVariable(name: "hash", scope: !371, file: !3, line: 460, type: !58)
!394 = !DILocalVariable(name: "key", scope: !371, file: !3, line: 461, type: !58)
!395 = !DILocalVariable(name: "hash_16bytes", scope: !396, file: !3, line: 495, type: !374)
!396 = distinct !DILexicalBlock(scope: !397, file: !3, line: 494, column: 19)
!397 = distinct !DILexicalBlock(scope: !371, file: !3, line: 494, column: 7)
!398 = !DILocation(line: 455, column: 23, scope: !371, inlinedAt: !399)
!399 = distinct !DILocation(line: 881, column: 12, scope: !400, inlinedAt: !447)
!400 = distinct !DILexicalBlock(scope: !401, file: !3, line: 881, column: 11)
!401 = distinct !DILexicalBlock(scope: !402, file: !3, line: 862, column: 15)
!402 = distinct !DILexicalBlock(scope: !403, file: !3, line: 862, column: 9)
!403 = distinct !DILexicalBlock(scope: !404, file: !3, line: 802, column: 13)
!404 = distinct !DILexicalBlock(scope: !405, file: !3, line: 802, column: 7)
!405 = distinct !DISubprogram(name: "process_packet", scope: !3, file: !3, line: 617, type: !406, scopeLine: 617, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !408)
!406 = !DISubroutineType(types: !407)
!407 = !{!72, !346, !95, !374}
!408 = !{!409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !431, !432, !433, !436, !437, !438, !439, !442, !443, !446}
!409 = !DILocalVariable(name: "xdp", arg: 1, scope: !405, file: !3, line: 617, type: !346)
!410 = !DILocalVariable(name: "off", arg: 2, scope: !405, file: !3, line: 617, type: !95)
!411 = !DILocalVariable(name: "is_ipv6", arg: 3, scope: !405, file: !3, line: 617, type: !374)
!412 = !DILocalVariable(name: "data", scope: !405, file: !3, line: 618, type: !44)
!413 = !DILocalVariable(name: "data_end", scope: !405, file: !3, line: 619, type: !44)
!414 = !DILocalVariable(name: "cval", scope: !405, file: !3, line: 620, type: !87)
!415 = !DILocalVariable(name: "dst", scope: !405, file: !3, line: 621, type: !231)
!416 = !DILocalVariable(name: "pckt", scope: !405, file: !3, line: 622, type: !377)
!417 = !DILocalVariable(name: "vip", scope: !405, file: !3, line: 623, type: !124)
!418 = !DILocalVariable(name: "vip_info", scope: !405, file: !3, line: 624, type: !139)
!419 = !DILocalVariable(name: "data_stats", scope: !405, file: !3, line: 625, type: !255)
!420 = !DILocalVariable(name: "iph_len", scope: !405, file: !3, line: 626, type: !95)
!421 = !DILocalVariable(name: "protocol", scope: !405, file: !3, line: 627, type: !55)
!422 = !DILocalVariable(name: "original_sport", scope: !405, file: !3, line: 628, type: !46)
!423 = !DILocalVariable(name: "action", scope: !405, file: !3, line: 630, type: !72)
!424 = !DILocalVariable(name: "vip_num", scope: !405, file: !3, line: 631, type: !58)
!425 = !DILocalVariable(name: "mac_addr_pos", scope: !405, file: !3, line: 632, type: !58)
!426 = !DILocalVariable(name: "pkt_bytes", scope: !405, file: !3, line: 633, type: !46)
!427 = !DILocalVariable(name: "stats_key", scope: !405, file: !3, line: 751, type: !58)
!428 = !DILocalVariable(name: "quic_stats_key", scope: !429, file: !3, line: 762, type: !58)
!429 = distinct !DILexicalBlock(scope: !430, file: !3, line: 761, column: 39)
!430 = distinct !DILexicalBlock(scope: !405, file: !3, line: 761, column: 7)
!431 = !DILocalVariable(name: "quic_stats", scope: !429, file: !3, line: 763, type: !255)
!432 = !DILocalVariable(name: "real_index", scope: !429, file: !3, line: 767, type: !72)
!433 = !DILocalVariable(name: "key", scope: !434, file: !3, line: 771, type: !58)
!434 = distinct !DILexicalBlock(scope: !435, file: !3, line: 769, column: 25)
!435 = distinct !DILexicalBlock(scope: !429, file: !3, line: 769, column: 9)
!436 = !DILocalVariable(name: "real_pos", scope: !434, file: !3, line: 772, type: !85)
!437 = !DILocalVariable(name: "cpu_num", scope: !403, file: !3, line: 808, type: !58)
!438 = !DILocalVariable(name: "lru_map", scope: !403, file: !3, line: 809, type: !44)
!439 = !DILocalVariable(name: "lru_stats_key", scope: !440, file: !3, line: 812, type: !58)
!440 = distinct !DILexicalBlock(scope: !441, file: !3, line: 810, column: 19)
!441 = distinct !DILexicalBlock(scope: !403, file: !3, line: 810, column: 9)
!442 = !DILocalVariable(name: "lru_stats", scope: !440, file: !3, line: 813, type: !255)
!443 = !DILocalVariable(name: "lru_stats_key", scope: !444, file: !3, line: 864, type: !58)
!444 = distinct !DILexicalBlock(scope: !445, file: !3, line: 863, column: 43)
!445 = distinct !DILexicalBlock(scope: !401, file: !3, line: 863, column: 11)
!446 = !DILocalVariable(name: "lru_stats", scope: !444, file: !3, line: 865, type: !255)
!447 = distinct !DILocation(line: 952, column: 12, scope: !448)
!448 = distinct !DILexicalBlock(scope: !449, file: !3, line: 951, column: 42)
!449 = distinct !DILexicalBlock(scope: !450, file: !3, line: 951, column: 14)
!450 = distinct !DILexicalBlock(scope: !343, file: !3, line: 949, column: 7)
!451 = !DILocalVariable(name: "tmp_addr", scope: !452, file: !453, line: 97, type: !133)
!452 = distinct !DISubprogram(name: "send_icmp6_reply", scope: !453, file: !453, line: 92, type: !454, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !456)
!453 = !DIFile(filename: "./handle_icmp.h", directory: "/home/sayandes/codequery/extraction")
!454 = !DISubroutineType(types: !455)
!455 = !{!72, !44, !44}
!456 = !{!457, !458, !459, !486, !451, !527}
!457 = !DILocalVariable(name: "data", arg: 1, scope: !452, file: !453, line: 93, type: !44)
!458 = !DILocalVariable(name: "data_end", arg: 2, scope: !452, file: !453, line: 94, type: !44)
!459 = !DILocalVariable(name: "ip6h", scope: !452, file: !453, line: 95, type: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !462, line: 116, size: 320, elements: !463)
!462 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "")
!463 = !{!464, !465, !466, !470, !471, !472, !473, !485}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !461, file: !462, line: 118, baseType: !55, size: 4, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !461, file: !462, line: 119, baseType: !55, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !461, file: !462, line: 126, baseType: !467, size: 24, offset: 8)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 24, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 3)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !461, file: !462, line: 128, baseType: !367, size: 16, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !461, file: !462, line: 129, baseType: !55, size: 8, offset: 48)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !461, file: !462, line: 130, baseType: !55, size: 8, offset: 56)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !461, file: !462, line: 132, baseType: !474, size: 128, offset: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !475, line: 33, size: 128, elements: !476)
!475 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !474, file: !475, line: 40, baseType: !478, size: 128)
!478 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !474, file: !475, line: 34, size: 128, elements: !479)
!479 = !{!480, !482, !484}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !478, file: !475, line: 35, baseType: !481, size: 128)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 128, elements: !105)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !478, file: !475, line: 37, baseType: !483, size: 128)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 128, elements: !62)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !478, file: !475, line: 38, baseType: !133, size: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !461, file: !462, line: 133, baseType: !474, size: 128, offset: 192)
!486 = !DILocalVariable(name: "icmp_hdr", scope: !452, file: !453, line: 96, type: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6hdr", file: !489, line: 8, size: 64, elements: !490)
!489 = !DIFile(filename: "/usr/include/linux/icmpv6.h", directory: "")
!490 = !{!491, !492, !493, !495}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_type", scope: !488, file: !489, line: 10, baseType: !55, size: 8)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_code", scope: !488, file: !489, line: 11, baseType: !55, size: 8, offset: 8)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_cksum", scope: !488, file: !489, line: 12, baseType: !494, size: 16, offset: 16)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !131, line: 31, baseType: !46)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_dataun", scope: !488, file: !489, line: 63, baseType: !496, size: 32, offset: 32)
!496 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !488, file: !489, line: 15, size: 32, elements: !497)
!497 = !{!498, !500, !502, !504, !509, !517}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "un_data32", scope: !496, file: !489, line: 16, baseType: !499, size: 32)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 32, elements: !120)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "un_data16", scope: !496, file: !489, line: 17, baseType: !501, size: 32)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 32, elements: !82)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "un_data8", scope: !496, file: !489, line: 18, baseType: !503, size: 32)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !134)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "u_echo", scope: !496, file: !489, line: 23, baseType: !505, size: 32)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_echo", file: !489, line: 20, size: 32, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !505, file: !489, line: 21, baseType: !367, size: 16)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !505, file: !489, line: 22, baseType: !367, size: 16, offset: 16)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_advt", scope: !496, file: !489, line: 40, baseType: !510, size: 32)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_advt", file: !489, line: 25, size: 32, elements: !511)
!511 = !{!512, !513, !514, !515, !516}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !510, file: !489, line: 27, baseType: !58, size: 5, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !510, file: !489, line: 28, baseType: !58, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "solicited", scope: !510, file: !489, line: 29, baseType: !58, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "router", scope: !510, file: !489, line: 30, baseType: !58, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !510, file: !489, line: 31, baseType: !58, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_ra", scope: !496, file: !489, line: 61, baseType: !518, size: 32)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_ra", file: !489, line: 42, size: 32, elements: !519)
!519 = !{!520, !521, !522, !523, !524, !525, !526}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !518, file: !489, line: 43, baseType: !55, size: 8)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !518, file: !489, line: 45, baseType: !55, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "router_pref", scope: !518, file: !489, line: 46, baseType: !55, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "home_agent", scope: !518, file: !489, line: 47, baseType: !55, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 8)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !518, file: !489, line: 48, baseType: !55, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 8)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "managed", scope: !518, file: !489, line: 49, baseType: !55, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "rt_lifetime", scope: !518, file: !489, line: 60, baseType: !367, size: 16, offset: 16)
!527 = !DILocalVariable(name: "off", scope: !452, file: !453, line: 98, type: !95)
!528 = !DILocation(line: 97, column: 10, scope: !452, inlinedAt: !529)
!529 = distinct !DILocation(line: 235, column: 12, scope: !530, inlinedAt: !542)
!530 = distinct !DILexicalBlock(scope: !531, file: !453, line: 234, column: 52)
!531 = distinct !DILexicalBlock(scope: !532, file: !453, line: 234, column: 7)
!532 = distinct !DISubprogram(name: "parse_icmpv6", scope: !453, file: !453, line: 223, type: !533, scopeLine: 227, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !535)
!533 = !DISubroutineType(types: !534)
!534 = !{!72, !44, !44, !95, !376}
!535 = !{!536, !537, !538, !539, !540, !541}
!536 = !DILocalVariable(name: "data", arg: 1, scope: !532, file: !453, line: 224, type: !44)
!537 = !DILocalVariable(name: "data_end", arg: 2, scope: !532, file: !453, line: 225, type: !44)
!538 = !DILocalVariable(name: "off", arg: 3, scope: !532, file: !453, line: 226, type: !95)
!539 = !DILocalVariable(name: "pckt", arg: 4, scope: !532, file: !453, line: 227, type: !376)
!540 = !DILocalVariable(name: "icmp_hdr", scope: !532, file: !453, line: 228, type: !487)
!541 = !DILocalVariable(name: "ip6h", scope: !532, file: !453, line: 229, type: !460)
!542 = distinct !DILocation(line: 144, column: 16, scope: !543, inlinedAt: !579)
!543 = distinct !DILexicalBlock(scope: !544, file: !3, line: 143, column: 45)
!544 = distinct !DILexicalBlock(scope: !545, file: !3, line: 143, column: 16)
!545 = distinct !DILexicalBlock(scope: !546, file: !3, line: 140, column: 9)
!546 = distinct !DILexicalBlock(scope: !547, file: !3, line: 124, column: 16)
!547 = distinct !DILexicalBlock(scope: !548, file: !3, line: 124, column: 7)
!548 = distinct !DISubprogram(name: "process_l3_headers", scope: !3, file: !3, line: 112, type: !549, scopeLine: 119, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !552)
!549 = !DISubroutineType(types: !550)
!550 = !{!72, !376, !551, !95, !49, !44, !44, !374}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !578}
!553 = !DILocalVariable(name: "pckt", arg: 1, scope: !548, file: !3, line: 113, type: !376)
!554 = !DILocalVariable(name: "protocol", arg: 2, scope: !548, file: !3, line: 114, type: !551)
!555 = !DILocalVariable(name: "off", arg: 3, scope: !548, file: !3, line: 115, type: !95)
!556 = !DILocalVariable(name: "pkt_bytes", arg: 4, scope: !548, file: !3, line: 116, type: !49)
!557 = !DILocalVariable(name: "data", arg: 5, scope: !548, file: !3, line: 117, type: !44)
!558 = !DILocalVariable(name: "data_end", arg: 6, scope: !548, file: !3, line: 118, type: !44)
!559 = !DILocalVariable(name: "is_ipv6", arg: 7, scope: !548, file: !3, line: 119, type: !374)
!560 = !DILocalVariable(name: "iph_len", scope: !548, file: !3, line: 120, type: !95)
!561 = !DILocalVariable(name: "action", scope: !548, file: !3, line: 121, type: !72)
!562 = !DILocalVariable(name: "iph", scope: !548, file: !3, line: 122, type: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !565, line: 86, size: 160, elements: !566)
!565 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !564, file: !565, line: 88, baseType: !55, size: 4, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !564, file: !565, line: 89, baseType: !55, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !564, file: !565, line: 96, baseType: !55, size: 8, offset: 8)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !564, file: !565, line: 97, baseType: !367, size: 16, offset: 16)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !564, file: !565, line: 98, baseType: !367, size: 16, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !564, file: !565, line: 99, baseType: !367, size: 16, offset: 48)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !564, file: !565, line: 100, baseType: !55, size: 8, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !564, file: !565, line: 101, baseType: !55, size: 8, offset: 72)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !564, file: !565, line: 102, baseType: !494, size: 16, offset: 80)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !564, file: !565, line: 103, baseType: !130, size: 32, offset: 96)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !564, file: !565, line: 104, baseType: !130, size: 32, offset: 128)
!578 = !DILocalVariable(name: "ip6h", scope: !548, file: !3, line: 123, type: !460)
!579 = distinct !DILocation(line: 634, column: 12, scope: !405, inlinedAt: !447)
!580 = !DILocation(line: 622, column: 29, scope: !405, inlinedAt: !447)
!581 = !DILocation(line: 623, column: 25, scope: !405, inlinedAt: !447)
!582 = !DILocation(line: 455, column: 23, scope: !371, inlinedAt: !583)
!583 = distinct !DILocation(line: 881, column: 12, scope: !400, inlinedAt: !584)
!584 = distinct !DILocation(line: 950, column: 12, scope: !585)
!585 = distinct !DILexicalBlock(scope: !450, file: !3, line: 949, column: 33)
!586 = !DILocalVariable(name: "tmp_mac", scope: !587, file: !453, line: 42, type: !364)
!587 = distinct !DISubprogram(name: "swap_mac_and_send", scope: !453, file: !453, line: 38, type: !454, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !588)
!588 = !{!589, !590, !591, !586}
!589 = !DILocalVariable(name: "data", arg: 1, scope: !587, file: !453, line: 39, type: !44)
!590 = !DILocalVariable(name: "data_end", arg: 2, scope: !587, file: !453, line: 40, type: !44)
!591 = !DILocalVariable(name: "eth", scope: !587, file: !453, line: 41, type: !359)
!592 = !DILocation(line: 42, column: 17, scope: !587, inlinedAt: !593)
!593 = distinct !DILocation(line: 89, column: 10, scope: !594, inlinedAt: !625)
!594 = distinct !DISubprogram(name: "send_icmp_reply", scope: !453, file: !453, line: 60, type: !454, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !595)
!595 = !{!596, !597, !598, !599, !622, !623, !624}
!596 = !DILocalVariable(name: "data", arg: 1, scope: !594, file: !453, line: 61, type: !44)
!597 = !DILocalVariable(name: "data_end", arg: 2, scope: !594, file: !453, line: 62, type: !44)
!598 = !DILocalVariable(name: "iph", scope: !594, file: !453, line: 63, type: !563)
!599 = !DILocalVariable(name: "icmp_hdr", scope: !594, file: !453, line: 64, type: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr", file: !602, line: 69, size: 64, elements: !603)
!602 = !DIFile(filename: "/usr/include/linux/icmp.h", directory: "")
!603 = !{!604, !605, !606, !607}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !601, file: !602, line: 70, baseType: !55, size: 8)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !601, file: !602, line: 71, baseType: !55, size: 8, offset: 8)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !601, file: !602, line: 72, baseType: !494, size: 16, offset: 16)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !601, file: !602, line: 84, baseType: !608, size: 32, offset: 32)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !601, file: !602, line: 73, size: 32, elements: !609)
!609 = !{!610, !615, !616, !621}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !608, file: !602, line: 77, baseType: !611, size: 32)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !608, file: !602, line: 74, size: 32, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !611, file: !602, line: 75, baseType: !367, size: 16)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !611, file: !602, line: 76, baseType: !367, size: 16, offset: 16)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "gateway", scope: !608, file: !602, line: 78, baseType: !130, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !608, file: !602, line: 82, baseType: !617, size: 32)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !608, file: !602, line: 79, size: 32, elements: !618)
!618 = !{!619, !620}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !617, file: !602, line: 80, baseType: !367, size: 16)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !617, file: !602, line: 81, baseType: !367, size: 16, offset: 16)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !608, file: !602, line: 83, baseType: !503, size: 32)
!622 = !DILocalVariable(name: "tmp_addr", scope: !594, file: !453, line: 65, type: !58)
!623 = !DILocalVariable(name: "csum", scope: !594, file: !453, line: 66, type: !95)
!624 = !DILocalVariable(name: "off", scope: !594, file: !453, line: 67, type: !95)
!625 = distinct !DILocation(line: 267, column: 12, scope: !626, inlinedAt: !636)
!626 = distinct !DILexicalBlock(scope: !627, file: !453, line: 266, column: 36)
!627 = distinct !DILexicalBlock(scope: !628, file: !453, line: 266, column: 7)
!628 = distinct !DISubprogram(name: "parse_icmp", scope: !453, file: !453, line: 255, type: !533, scopeLine: 259, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !629)
!629 = !{!630, !631, !632, !633, !634, !635}
!630 = !DILocalVariable(name: "data", arg: 1, scope: !628, file: !453, line: 256, type: !44)
!631 = !DILocalVariable(name: "data_end", arg: 2, scope: !628, file: !453, line: 257, type: !44)
!632 = !DILocalVariable(name: "off", arg: 3, scope: !628, file: !453, line: 258, type: !95)
!633 = !DILocalVariable(name: "pckt", arg: 4, scope: !628, file: !453, line: 259, type: !376)
!634 = !DILocalVariable(name: "icmp_hdr", scope: !628, file: !453, line: 260, type: !600)
!635 = !DILocalVariable(name: "iph", scope: !628, file: !453, line: 261, type: !563)
!636 = distinct !DILocation(line: 174, column: 16, scope: !637, inlinedAt: !579)
!637 = distinct !DILexicalBlock(scope: !638, file: !3, line: 173, column: 36)
!638 = distinct !DILexicalBlock(scope: !639, file: !3, line: 173, column: 9)
!639 = distinct !DILexicalBlock(scope: !547, file: !3, line: 152, column: 10)
!640 = !DILocation(line: 42, column: 17, scope: !587, inlinedAt: !641)
!641 = distinct !DILocation(line: 116, column: 10, scope: !452, inlinedAt: !529)
!642 = !DILocation(line: 42, column: 17, scope: !587, inlinedAt: !643)
!643 = distinct !DILocation(line: 89, column: 10, scope: !594, inlinedAt: !644)
!644 = distinct !DILocation(line: 267, column: 12, scope: !626, inlinedAt: !645)
!645 = distinct !DILocation(line: 174, column: 16, scope: !637, inlinedAt: !646)
!646 = distinct !DILocation(line: 634, column: 12, scope: !405, inlinedAt: !584)
!647 = !DILocation(line: 42, column: 17, scope: !587, inlinedAt: !648)
!648 = distinct !DILocation(line: 116, column: 10, scope: !452, inlinedAt: !649)
!649 = distinct !DILocation(line: 235, column: 12, scope: !530, inlinedAt: !650)
!650 = distinct !DILocation(line: 144, column: 16, scope: !543, inlinedAt: !646)
!651 = !DILocation(line: 622, column: 29, scope: !405, inlinedAt: !584)
!652 = !DILocation(line: 623, column: 25, scope: !405, inlinedAt: !584)
!653 = !DILocation(line: 0, scope: !343)
!654 = !DILocation(line: 935, column: 34, scope: !343)
!655 = !{!656, !657, i64 0}
!656 = !{!"xdp_md", !657, i64 0, !657, i64 4, !657, i64 8, !657, i64 12, !657, i64 16}
!657 = !{!"int", !658, i64 0}
!658 = !{!"omnipotent char", !659, i64 0}
!659 = !{!"Simple C/C++ TBAA"}
!660 = !DILocation(line: 935, column: 23, scope: !343)
!661 = !DILocation(line: 935, column: 16, scope: !343)
!662 = !DILocation(line: 936, column: 38, scope: !343)
!663 = !{!656, !657, i64 4}
!664 = !DILocation(line: 936, column: 27, scope: !343)
!665 = !DILocation(line: 936, column: 20, scope: !343)
!666 = !DILocation(line: 942, column: 12, scope: !667)
!667 = distinct !DILexicalBlock(scope: !343, file: !3, line: 942, column: 7)
!668 = !DILocation(line: 942, column: 21, scope: !667)
!669 = !DILocation(line: 942, column: 7, scope: !343)
!670 = !DILocation(line: 937, column: 24, scope: !343)
!671 = !DILocation(line: 947, column: 20, scope: !343)
!672 = !{!673, !674, i64 12}
!673 = !{!"ethhdr", !658, i64 0, !658, i64 6, !674, i64 12}
!674 = !{!"short", !658, i64 0}
!675 = !DILocation(line: 949, column: 7, scope: !343)
!676 = !DILocation(line: 0, scope: !405, inlinedAt: !584)
!677 = !DILocation(line: 622, column: 3, scope: !405, inlinedAt: !584)
!678 = !DILocation(line: 623, column: 3, scope: !405, inlinedAt: !584)
!679 = !DILocation(line: 631, column: 3, scope: !405, inlinedAt: !584)
!680 = !DILocation(line: 632, column: 3, scope: !405, inlinedAt: !584)
!681 = !DILocation(line: 632, column: 9, scope: !405, inlinedAt: !584)
!682 = !{!657, !657, i64 0}
!683 = !DILocation(line: 0, scope: !548, inlinedAt: !646)
!684 = !DILocation(line: 154, column: 13, scope: !685, inlinedAt: !646)
!685 = distinct !DILexicalBlock(scope: !639, file: !3, line: 154, column: 9)
!686 = !DILocation(line: 154, column: 17, scope: !685, inlinedAt: !646)
!687 = !DILocation(line: 154, column: 9, scope: !639, inlinedAt: !646)
!688 = !DILocation(line: 158, column: 14, scope: !689, inlinedAt: !646)
!689 = distinct !DILexicalBlock(scope: !639, file: !3, line: 158, column: 9)
!690 = !DILocation(line: 158, column: 18, scope: !689, inlinedAt: !646)
!691 = !DILocation(line: 158, column: 9, scope: !639, inlinedAt: !646)
!692 = !DILocation(line: 163, column: 22, scope: !639, inlinedAt: !646)
!693 = !{!694, !658, i64 1}
!694 = !{!"iphdr", !658, i64 0, !658, i64 0, !658, i64 1, !674, i64 2, !674, i64 4, !674, i64 6, !658, i64 8, !658, i64 9, !674, i64 10, !657, i64 12, !657, i64 16}
!695 = !DILocation(line: 163, column: 11, scope: !639, inlinedAt: !646)
!696 = !DILocation(line: 163, column: 15, scope: !639, inlinedAt: !646)
!697 = !{!698, !658, i64 45}
!698 = !{!"packet_description", !699, i64 0, !657, i64 40, !658, i64 44, !658, i64 45}
!699 = !{!"flow_key", !658, i64 0, !658, i64 16, !658, i64 32, !658, i64 36}
!700 = !DILocation(line: 164, column: 22, scope: !639, inlinedAt: !646)
!701 = !{!694, !658, i64 9}
!702 = !DILocation(line: 165, column: 16, scope: !639, inlinedAt: !646)
!703 = !DILocation(line: 165, column: 22, scope: !639, inlinedAt: !646)
!704 = !{!698, !658, i64 36}
!705 = !DILocation(line: 166, column: 18, scope: !639, inlinedAt: !646)
!706 = !{!694, !674, i64 2}
!707 = !DILocation(line: 169, column: 14, scope: !708, inlinedAt: !646)
!708 = distinct !DILexicalBlock(scope: !639, file: !3, line: 169, column: 9)
!709 = !{!694, !674, i64 6}
!710 = !DILocation(line: 169, column: 23, scope: !708, inlinedAt: !646)
!711 = !DILocation(line: 169, column: 9, scope: !639, inlinedAt: !646)
!712 = !DILocation(line: 173, column: 19, scope: !638, inlinedAt: !646)
!713 = !DILocation(line: 173, column: 9, scope: !639, inlinedAt: !646)
!714 = !DILocation(line: 0, scope: !628, inlinedAt: !645)
!715 = !DILocation(line: 263, column: 16, scope: !716, inlinedAt: !645)
!716 = distinct !DILexicalBlock(scope: !628, file: !453, line: 263, column: 7)
!717 = !DILocation(line: 263, column: 20, scope: !716, inlinedAt: !645)
!718 = !DILocation(line: 263, column: 7, scope: !628, inlinedAt: !645)
!719 = !DILocation(line: 266, column: 17, scope: !627, inlinedAt: !645)
!720 = !{!721, !658, i64 0}
!721 = !{!"icmphdr", !658, i64 0, !658, i64 1, !674, i64 2, !658, i64 4}
!722 = !DILocation(line: 266, column: 7, scope: !628, inlinedAt: !645)
!723 = !DILocation(line: 0, scope: !594, inlinedAt: !644)
!724 = !DILocation(line: 77, column: 18, scope: !594, inlinedAt: !644)
!725 = !DILocation(line: 81, column: 13, scope: !594, inlinedAt: !644)
!726 = !DILocation(line: 81, column: 22, scope: !594, inlinedAt: !644)
!727 = !{!721, !674, i64 2}
!728 = !DILocation(line: 82, column: 8, scope: !594, inlinedAt: !644)
!729 = !DILocation(line: 82, column: 12, scope: !594, inlinedAt: !644)
!730 = !{!694, !658, i64 8}
!731 = !DILocation(line: 83, column: 19, scope: !594, inlinedAt: !644)
!732 = !{!694, !657, i64 16}
!733 = !DILocation(line: 84, column: 21, scope: !594, inlinedAt: !644)
!734 = !{!694, !657, i64 12}
!735 = !DILocation(line: 84, column: 14, scope: !594, inlinedAt: !644)
!736 = !DILocation(line: 85, column: 14, scope: !594, inlinedAt: !644)
!737 = !DILocation(line: 86, column: 8, scope: !594, inlinedAt: !644)
!738 = !DILocalVariable(name: "iph", arg: 1, scope: !739, file: !740, line: 52, type: !44)
!739 = distinct !DISubprogram(name: "ipv4_csum_inline", scope: !740, file: !740, line: 51, type: !741, scopeLine: 53, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !744)
!740 = !DIFile(filename: "./csum_helpers.h", directory: "/home/sayandes/codequery/extraction")
!741 = !DISubroutineType(types: !742)
!742 = !{null, !44, !743}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!744 = !{!738, !745, !746, !747}
!745 = !DILocalVariable(name: "csum", arg: 2, scope: !739, file: !740, line: 53, type: !743)
!746 = !DILocalVariable(name: "next_iph_u16", scope: !739, file: !740, line: 54, type: !49)
!747 = !DILocalVariable(name: "i", scope: !748, file: !740, line: 56, type: !72)
!748 = distinct !DILexicalBlock(scope: !739, file: !740, line: 56, column: 3)
!749 = !DILocation(line: 0, scope: !739, inlinedAt: !750)
!750 = distinct !DILocation(line: 87, column: 3, scope: !594, inlinedAt: !644)
!751 = !DILocation(line: 54, column: 25, scope: !739, inlinedAt: !750)
!752 = !DILocation(line: 0, scope: !748, inlinedAt: !750)
!753 = !DILocation(line: 57, column: 14, scope: !754, inlinedAt: !750)
!754 = distinct !DILexicalBlock(scope: !755, file: !740, line: 56, column: 55)
!755 = distinct !DILexicalBlock(scope: !748, file: !740, line: 56, column: 3)
!756 = !{!674, !674, i64 0}
!757 = !DILocation(line: 57, column: 27, scope: !754, inlinedAt: !750)
!758 = !DILocation(line: 57, column: 11, scope: !754, inlinedAt: !750)
!759 = !DILocalVariable(name: "i", scope: !760, file: !740, line: 32, type: !72)
!760 = distinct !DISubprogram(name: "csum_fold_helper", scope: !740, file: !740, line: 30, type: !761, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !763)
!761 = !DISubroutineType(types: !762)
!762 = !{!46, !95}
!763 = !{!764, !759}
!764 = !DILocalVariable(name: "csum", arg: 1, scope: !760, file: !740, line: 31, type: !95)
!765 = !DILocation(line: 0, scope: !760, inlinedAt: !766)
!766 = distinct !DILocation(line: 59, column: 11, scope: !739, inlinedAt: !750)
!767 = !DILocation(line: 35, column: 14, scope: !768, inlinedAt: !766)
!768 = distinct !DILexicalBlock(scope: !769, file: !740, line: 35, column: 9)
!769 = distinct !DILexicalBlock(scope: !770, file: !740, line: 34, column: 27)
!770 = distinct !DILexicalBlock(scope: !771, file: !740, line: 34, column: 3)
!771 = distinct !DILexicalBlock(scope: !760, file: !740, line: 34, column: 3)
!772 = !DILocation(line: 35, column: 9, scope: !769, inlinedAt: !766)
!773 = !DILocation(line: 88, column: 16, scope: !594, inlinedAt: !644)
!774 = !DILocation(line: 88, column: 14, scope: !594, inlinedAt: !644)
!775 = !{!694, !674, i64 10}
!776 = !DILocation(line: 0, scope: !587, inlinedAt: !643)
!777 = !DILocation(line: 42, column: 3, scope: !587, inlinedAt: !643)
!778 = !DILocation(line: 44, column: 24, scope: !587, inlinedAt: !643)
!779 = !DILocation(line: 44, column: 3, scope: !587, inlinedAt: !643)
!780 = !DILocation(line: 45, column: 3, scope: !587, inlinedAt: !643)
!781 = !DILocation(line: 46, column: 3, scope: !587, inlinedAt: !643)
!782 = !DILocation(line: 48, column: 1, scope: !587, inlinedAt: !643)
!783 = !DILocation(line: 267, column: 5, scope: !626, inlinedAt: !645)
!784 = !DILocation(line: 274, column: 11, scope: !785, inlinedAt: !645)
!785 = distinct !DILexicalBlock(scope: !628, file: !453, line: 274, column: 7)
!786 = !DILocation(line: 274, column: 15, scope: !785, inlinedAt: !645)
!787 = !DILocation(line: 274, column: 7, scope: !628, inlinedAt: !645)
!788 = !DILocation(line: 277, column: 12, scope: !789, inlinedAt: !645)
!789 = distinct !DILexicalBlock(scope: !628, file: !453, line: 277, column: 7)
!790 = !DILocation(line: 277, column: 16, scope: !789, inlinedAt: !645)
!791 = !DILocation(line: 277, column: 7, scope: !628, inlinedAt: !645)
!792 = !DILocation(line: 280, column: 27, scope: !628, inlinedAt: !645)
!793 = !DILocation(line: 280, column: 20, scope: !628, inlinedAt: !645)
!794 = !DILocation(line: 281, column: 9, scope: !628, inlinedAt: !645)
!795 = !DILocation(line: 281, column: 15, scope: !628, inlinedAt: !645)
!796 = !{!698, !658, i64 44}
!797 = !DILocation(line: 282, column: 25, scope: !628, inlinedAt: !645)
!798 = !DILocation(line: 282, column: 14, scope: !628, inlinedAt: !645)
!799 = !DILocation(line: 282, column: 18, scope: !628, inlinedAt: !645)
!800 = !{!658, !658, i64 0}
!801 = !DILocation(line: 283, column: 25, scope: !628, inlinedAt: !645)
!802 = !DILocation(line: 175, column: 11, scope: !637, inlinedAt: !646)
!803 = !DILocation(line: 179, column: 29, scope: !804, inlinedAt: !646)
!804 = distinct !DILexicalBlock(scope: !638, file: !3, line: 178, column: 12)
!805 = !DILocation(line: 179, column: 18, scope: !804, inlinedAt: !646)
!806 = !DILocation(line: 179, column: 22, scope: !804, inlinedAt: !646)
!807 = !DILocation(line: 180, column: 29, scope: !804, inlinedAt: !646)
!808 = !DILocation(line: 639, column: 24, scope: !405, inlinedAt: !584)
!809 = !DILocation(line: 0, scope: !638, inlinedAt: !646)
!810 = !DILocation(line: 686, column: 7, scope: !405, inlinedAt: !584)
!811 = !DILocalVariable(name: "data", arg: 1, scope: !812, file: !52, line: 103, type: !44)
!812 = distinct !DISubprogram(name: "parse_tcp", scope: !52, file: !52, line: 102, type: !813, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !815)
!813 = !DISubroutineType(types: !814)
!814 = !{!374, !44, !44, !374, !376}
!815 = !{!811, !816, !817, !818, !819, !820, !821}
!816 = !DILocalVariable(name: "data_end", arg: 2, scope: !812, file: !52, line: 104, type: !44)
!817 = !DILocalVariable(name: "is_ipv6", arg: 3, scope: !812, file: !52, line: 105, type: !374)
!818 = !DILocalVariable(name: "pckt", arg: 4, scope: !812, file: !52, line: 106, type: !376)
!819 = !DILocalVariable(name: "is_icmp", scope: !812, file: !52, line: 107, type: !374)
!820 = !DILocalVariable(name: "off", scope: !812, file: !52, line: 108, type: !95)
!821 = !DILocalVariable(name: "tcp", scope: !812, file: !52, line: 109, type: !822)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !824, line: 25, size: 160, elements: !825)
!824 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "")
!825 = !{!826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !823, file: !824, line: 26, baseType: !367, size: 16)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !823, file: !824, line: 27, baseType: !367, size: 16, offset: 16)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !823, file: !824, line: 28, baseType: !130, size: 32, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !823, file: !824, line: 29, baseType: !130, size: 32, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !823, file: !824, line: 31, baseType: !46, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !823, file: !824, line: 32, baseType: !46, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !823, file: !824, line: 33, baseType: !46, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !823, file: !824, line: 34, baseType: !46, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !823, file: !824, line: 35, baseType: !46, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !823, file: !824, line: 36, baseType: !46, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !823, file: !824, line: 37, baseType: !46, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !823, file: !824, line: 38, baseType: !46, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !823, file: !824, line: 39, baseType: !46, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !823, file: !824, line: 40, baseType: !46, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !823, file: !824, line: 55, baseType: !367, size: 16, offset: 112)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !823, file: !824, line: 56, baseType: !494, size: 16, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !823, file: !824, line: 57, baseType: !367, size: 16, offset: 144)
!843 = !DILocation(line: 0, scope: !812, inlinedAt: !844)
!844 = distinct !DILocation(line: 687, column: 10, scope: !845, inlinedAt: !584)
!845 = distinct !DILexicalBlock(scope: !846, file: !3, line: 687, column: 9)
!846 = distinct !DILexicalBlock(scope: !847, file: !3, line: 686, column: 32)
!847 = distinct !DILexicalBlock(scope: !405, file: !3, line: 686, column: 7)
!848 = !DILocation(line: 107, column: 27, scope: !812, inlinedAt: !844)
!849 = !DILocation(line: 107, column: 43, scope: !812, inlinedAt: !844)
!850 = !DILocalVariable(name: "is_ipv6", arg: 1, scope: !851, file: !52, line: 59, type: !374)
!851 = distinct !DISubprogram(name: "calc_offset", scope: !52, file: !52, line: 58, type: !852, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !854)
!852 = !DISubroutineType(types: !853)
!853 = !{!95, !374, !374}
!854 = !{!850, !855, !856}
!855 = !DILocalVariable(name: "is_icmp", arg: 2, scope: !851, file: !52, line: 60, type: !374)
!856 = !DILocalVariable(name: "off", scope: !851, file: !52, line: 61, type: !95)
!857 = !DILocation(line: 0, scope: !851, inlinedAt: !858)
!858 = distinct !DILocation(line: 108, column: 15, scope: !812, inlinedAt: !844)
!859 = !DILocation(line: 62, column: 7, scope: !851, inlinedAt: !858)
!860 = !DILocation(line: 110, column: 14, scope: !812, inlinedAt: !844)
!861 = !DILocation(line: 112, column: 11, scope: !862, inlinedAt: !844)
!862 = distinct !DILexicalBlock(scope: !812, file: !52, line: 112, column: 7)
!863 = !DILocation(line: 112, column: 15, scope: !862, inlinedAt: !844)
!864 = !DILocation(line: 112, column: 7, scope: !812, inlinedAt: !844)
!865 = !DILocation(line: 116, column: 12, scope: !866, inlinedAt: !844)
!866 = distinct !DILexicalBlock(scope: !812, file: !52, line: 116, column: 7)
!867 = !DILocation(line: 116, column: 7, scope: !866, inlinedAt: !844)
!868 = !DILocation(line: 116, column: 7, scope: !812, inlinedAt: !844)
!869 = !DILocation(line: 117, column: 17, scope: !870, inlinedAt: !844)
!870 = distinct !DILexicalBlock(scope: !866, file: !52, line: 116, column: 17)
!871 = !DILocation(line: 118, column: 3, scope: !870, inlinedAt: !844)
!872 = !DILocation(line: 120, column: 7, scope: !812, inlinedAt: !844)
!873 = !DILocation(line: 121, column: 33, scope: !874, inlinedAt: !844)
!874 = distinct !DILexicalBlock(scope: !875, file: !52, line: 120, column: 17)
!875 = distinct !DILexicalBlock(scope: !812, file: !52, line: 120, column: 7)
!876 = !{!877, !674, i64 0}
!877 = !{!"tcphdr", !674, i64 0, !674, i64 2, !657, i64 4, !657, i64 8, !674, i64 12, !674, i64 12, !674, i64 13, !674, i64 13, !674, i64 13, !674, i64 13, !674, i64 13, !674, i64 13, !674, i64 13, !674, i64 13, !674, i64 14, !674, i64 16, !674, i64 18}
!878 = !DILocation(line: 121, column: 16, scope: !874, inlinedAt: !844)
!879 = !DILocation(line: 121, column: 5, scope: !874, inlinedAt: !844)
!880 = !DILocation(line: 121, column: 26, scope: !874, inlinedAt: !844)
!881 = !DILocation(line: 122, column: 33, scope: !874, inlinedAt: !844)
!882 = !DILocation(line: 123, column: 3, scope: !874, inlinedAt: !844)
!883 = !DILocation(line: 126, column: 33, scope: !884, inlinedAt: !844)
!884 = distinct !DILexicalBlock(scope: !875, file: !52, line: 123, column: 10)
!885 = !{!877, !674, i64 2}
!886 = !DILocation(line: 126, column: 16, scope: !884, inlinedAt: !844)
!887 = !DILocation(line: 126, column: 5, scope: !884, inlinedAt: !844)
!888 = !DILocation(line: 126, column: 26, scope: !884, inlinedAt: !844)
!889 = !DILocalVariable(name: "data", arg: 1, scope: !890, file: !52, line: 77, type: !44)
!890 = distinct !DISubprogram(name: "parse_udp", scope: !52, file: !52, line: 76, type: !813, scopeLine: 80, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !891)
!891 = !{!889, !892, !893, !894, !895, !896, !897}
!892 = !DILocalVariable(name: "data_end", arg: 2, scope: !890, file: !52, line: 78, type: !44)
!893 = !DILocalVariable(name: "is_ipv6", arg: 3, scope: !890, file: !52, line: 79, type: !374)
!894 = !DILocalVariable(name: "pckt", arg: 4, scope: !890, file: !52, line: 80, type: !376)
!895 = !DILocalVariable(name: "is_icmp", scope: !890, file: !52, line: 81, type: !374)
!896 = !DILocalVariable(name: "off", scope: !890, file: !52, line: 82, type: !95)
!897 = !DILocalVariable(name: "udp", scope: !890, file: !52, line: 83, type: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !900, line: 23, size: 64, elements: !901)
!900 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "")
!901 = !{!902, !903, !904, !905}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !899, file: !900, line: 24, baseType: !367, size: 16)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !899, file: !900, line: 25, baseType: !367, size: 16, offset: 16)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !899, file: !900, line: 26, baseType: !367, size: 16, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !899, file: !900, line: 27, baseType: !494, size: 16, offset: 48)
!906 = !DILocation(line: 0, scope: !890, inlinedAt: !907)
!907 = distinct !DILocation(line: 691, column: 10, scope: !908, inlinedAt: !584)
!908 = distinct !DILexicalBlock(scope: !909, file: !3, line: 691, column: 9)
!909 = distinct !DILexicalBlock(scope: !910, file: !3, line: 690, column: 39)
!910 = distinct !DILexicalBlock(scope: !847, file: !3, line: 690, column: 14)
!911 = !DILocation(line: 81, column: 43, scope: !890, inlinedAt: !907)
!912 = !DILocation(line: 0, scope: !851, inlinedAt: !913)
!913 = distinct !DILocation(line: 82, column: 15, scope: !890, inlinedAt: !907)
!914 = !DILocation(line: 62, column: 7, scope: !851, inlinedAt: !913)
!915 = !DILocation(line: 84, column: 14, scope: !890, inlinedAt: !907)
!916 = !DILocation(line: 86, column: 11, scope: !917, inlinedAt: !907)
!917 = distinct !DILexicalBlock(scope: !890, file: !52, line: 86, column: 7)
!918 = !DILocation(line: 86, column: 15, scope: !917, inlinedAt: !907)
!919 = !DILocation(line: 86, column: 7, scope: !890, inlinedAt: !907)
!920 = !DILocation(line: 90, column: 7, scope: !890, inlinedAt: !907)
!921 = !DILocation(line: 91, column: 33, scope: !922, inlinedAt: !907)
!922 = distinct !DILexicalBlock(scope: !923, file: !52, line: 90, column: 17)
!923 = distinct !DILexicalBlock(scope: !890, file: !52, line: 90, column: 7)
!924 = !{!925, !674, i64 0}
!925 = !{!"udphdr", !674, i64 0, !674, i64 2, !674, i64 4, !674, i64 6}
!926 = !DILocation(line: 91, column: 16, scope: !922, inlinedAt: !907)
!927 = !DILocation(line: 91, column: 5, scope: !922, inlinedAt: !907)
!928 = !DILocation(line: 91, column: 26, scope: !922, inlinedAt: !907)
!929 = !DILocation(line: 92, column: 33, scope: !922, inlinedAt: !907)
!930 = !DILocation(line: 93, column: 3, scope: !922, inlinedAt: !907)
!931 = !DILocation(line: 96, column: 33, scope: !932, inlinedAt: !907)
!932 = distinct !DILexicalBlock(scope: !923, file: !52, line: 93, column: 10)
!933 = !{!925, !674, i64 2}
!934 = !DILocation(line: 96, column: 16, scope: !932, inlinedAt: !907)
!935 = !DILocation(line: 96, column: 5, scope: !932, inlinedAt: !907)
!936 = !DILocation(line: 96, column: 26, scope: !932, inlinedAt: !907)
!937 = !DILocation(line: 0, scope: !847, inlinedAt: !584)
!938 = !DILocation(line: 712, column: 9, scope: !939, inlinedAt: !584)
!939 = distinct !DILexicalBlock(scope: !940, file: !3, line: 711, column: 10)
!940 = distinct !DILexicalBlock(scope: !405, file: !3, line: 709, column: 7)
!941 = !DILocation(line: 712, column: 13, scope: !939, inlinedAt: !584)
!942 = !DILocation(line: 715, column: 24, scope: !405, inlinedAt: !584)
!943 = !DILocation(line: 715, column: 14, scope: !405, inlinedAt: !584)
!944 = !DILocation(line: 715, column: 7, scope: !405, inlinedAt: !584)
!945 = !DILocation(line: 715, column: 12, scope: !405, inlinedAt: !584)
!946 = !{!947, !674, i64 16}
!947 = !{!"vip_definition", !658, i64 0, !674, i64 16, !658, i64 18}
!948 = !DILocation(line: 716, column: 7, scope: !405, inlinedAt: !584)
!949 = !DILocation(line: 716, column: 13, scope: !405, inlinedAt: !584)
!950 = !{!947, !658, i64 18}
!951 = !DILocation(line: 717, column: 14, scope: !405, inlinedAt: !584)
!952 = !DILocation(line: 718, column: 8, scope: !953, inlinedAt: !584)
!953 = distinct !DILexicalBlock(scope: !405, file: !3, line: 718, column: 7)
!954 = !DILocation(line: 718, column: 7, scope: !405, inlinedAt: !584)
!955 = !DILocation(line: 719, column: 14, scope: !956, inlinedAt: !584)
!956 = distinct !DILexicalBlock(scope: !953, file: !3, line: 718, column: 18)
!957 = !DILocation(line: 720, column: 16, scope: !956, inlinedAt: !584)
!958 = !DILocation(line: 721, column: 10, scope: !959, inlinedAt: !584)
!959 = distinct !DILexicalBlock(scope: !956, file: !3, line: 721, column: 9)
!960 = !DILocation(line: 721, column: 9, scope: !956, inlinedAt: !584)
!961 = !DILocation(line: 725, column: 21, scope: !962, inlinedAt: !584)
