; ModuleID = 'extracted.c'
source_filename = "extracted.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.anon.3 = type { [2 x i32]*, i32*, %struct.ctl_value*, [16 x i32]*, [0 x i32]* }
%struct.ctl_value = type { %union.anon.4 }
%union.anon.4 = type { i64 }
%struct.anon.5 = type { [1 x i32]*, %struct.vip_definition*, %struct.vip_meta*, [512 x i32]*, [0 x i32]* }
%struct.vip_definition = type { %union.anon.6, i16, i8 }
%union.anon.6 = type { [4 x i32] }
%struct.vip_meta = type { i32, i32 }
%struct.anon.7 = type { [12 x i32]*, [4 x i32]*, [4 x i32]*, [128 x i32]*, [0 x i32]* }
%struct.anon.8 = type { [9 x i32]*, %struct.flow_key*, %struct.real_pos_lru*, [1000 x i32]*, [0 x i32]* }
%struct.flow_key = type { %union.anon.9, %union.anon.10, %union.anon.11, i8 }
%union.anon.9 = type { [4 x i32] }
%union.anon.10 = type { [4 x i32] }
%union.anon.11 = type { i32 }
%struct.real_pos_lru = type { i32, i64 }
%struct.anon.12 = type { [2 x i32]*, i32*, i32*, [33554944 x i32]*, [0 x i32]* }
%struct.anon.13 = type { [2 x i32]*, i32*, %struct.real_definition*, [4096 x i32]*, [0 x i32]* }
%struct.real_definition = type { %union.anon.14, i8 }
%union.anon.14 = type { [4 x i32] }
%struct.anon.15 = type { [6 x i32]*, i32*, %struct.lb_stats*, [4096 x i32]*, [0 x i32]* }
%struct.lb_stats = type { i64, i64 }
%struct.anon.16 = type { [6 x i32]*, i32*, %struct.lb_stats*, [1024 x i32]*, [0 x i32]* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 735, type: !337, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !73, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "extracted.c", directory: "/home/sayandes/github/hook-point-transformer/src/katran-test/extraction")
!4 = !{!5, !35}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 28, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/in.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!9 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!13 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!15 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!16 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!17 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!18 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!19 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!20 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!21 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!22 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!23 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!24 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!25 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!26 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!27 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!28 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!29 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!30 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!31 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!32 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!33 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!34 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !36, line: 3112, baseType: !7, size: 32, elements: !37)
!36 = !DIFile(filename: "./bpf.h", directory: "/home/sayandes/github/hook-point-transformer/src/katran-test/extraction")
!37 = !{!38, !39, !40, !41, !42}
!38 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!39 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!40 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!41 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!42 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!43 = !{!44, !45, !46, !49, !50, !64, !69, !70, !72}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !47, line: 24, baseType: !48)
!47 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quic_long_header", file: !52, line: 20, size: 112, elements: !53)
!52 = !DIFile(filename: "./pckt_parsing.h", directory: "/home/sayandes/github/hook-point-transformer/src/katran-test/extraction")
!53 = !{!54, !57, !59, !60}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !51, file: !52, line: 21, baseType: !55, size: 8)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !47, line: 21, baseType: !56)
!56 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !51, file: !52, line: 22, baseType: !58, size: 32, offset: 8)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !47, line: 27, baseType: !7)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "conn_id_lens", scope: !51, file: !52, line: 23, baseType: !55, size: 8, offset: 40)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "dst_connection_id", scope: !51, file: !52, line: 24, baseType: !61, size: 64, offset: 48)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 64, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 8)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quic_short_header", file: !52, line: 26, size: 72, elements: !66)
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !52, line: 27, baseType: !55, size: 8)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "connection_id", scope: !65, file: !52, line: 28, baseType: !61, size: 64, offset: 8)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !71, line: 47, baseType: !7)
!71 = !DIFile(filename: "./jhash.h", directory: "/home/sayandes/github/hook-point-transformer/src/katran-test/extraction")
!72 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!73 = !{!0, !74, !112, !150, !169, !211, !224, !246, !262, !275, !288, !298, !314, !320, !325, !327, !332}
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "ctl_array", scope: !2, file: !76, line: 13, type: !77, isLocal: false, isDefinition: true)
!76 = !DIFile(filename: "./control_data_maps.h", directory: "/home/sayandes/github/hook-point-transformer/src/katran-test/extraction")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !76, line: 7, size: 320, elements: !78)
!78 = !{!79, !84, !86, !102, !107}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !77, file: !76, line: 8, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 64, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 2)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !77, file: !76, line: 9, baseType: !85, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !77, file: !76, line: 10, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_value", file: !89, line: 24, size: 64, elements: !90)
!89 = !DIFile(filename: "./balancer_structs.h", directory: "/home/sayandes/github/hook-point-transformer/src/katran-test/extraction")
!90 = !{!91}
!91 = !DIDerivedType(tag: DW_TAG_member, scope: !88, file: !89, line: 25, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !88, file: !89, line: 25, size: 64, elements: !93)
!93 = !{!94, !97, !98}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !92, file: !89, line: 26, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !47, line: 31, baseType: !96)
!96 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !92, file: !89, line: 27, baseType: !58, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !92, file: !89, line: 28, baseType: !99, size: 48)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 48, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 6)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !77, file: !76, line: 11, baseType: !103, size: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 512, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 16)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !77, file: !76, line: 12, baseType: !108, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 0)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "vip_map", scope: !2, file: !114, line: 13, type: !115, isLocal: false, isDefinition: true)
!114 = !DIFile(filename: "./balancer_maps.h", directory: "/home/sayandes/github/hook-point-transformer/src/katran-test/extraction")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 7, size: 320, elements: !116)
!116 = !{!117, !122, !138, !144, !149}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !115, file: !114, line: 8, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 1)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !115, file: !114, line: 9, baseType: !123, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vip_definition", file: !89, line: 31, size: 160, elements: !125)
!125 = !{!126, !136, !137}
!126 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !89, line: 32, baseType: !127, size: 128)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !89, line: 32, size: 128, elements: !128)
!128 = !{!129, !132}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !127, file: !89, line: 33, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !131, line: 27, baseType: !58)
!131 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!132 = !DIDerivedType(tag: DW_TAG_member, name: "vipv6", scope: !127, file: !89, line: 34, baseType: !133, size: 128)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 128, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 4)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !124, file: !89, line: 36, baseType: !46, size: 16, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !124, file: !89, line: 37, baseType: !55, size: 8, offset: 144)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !115, file: !114, line: 10, baseType: !139, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vip_meta", file: !89, line: 39, size: 64, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !140, file: !89, line: 40, baseType: !58, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "vip_num", scope: !140, file: !89, line: 41, baseType: !58, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !115, file: !114, line: 11, baseType: !145, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 16384, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !115, file: !114, line: 12, baseType: !108, size: 64, offset: 256)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "lru_mapping", scope: !2, file: !114, line: 20, type: !152, isLocal: false, isDefinition: true)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 14, size: 320, elements: !153)
!153 = !{!154, !159, !162, !163, !168}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !152, file: !114, line: 15, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 384, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 12)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !152, file: !114, line: 16, baseType: !160, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 128, elements: !134)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !152, file: !114, line: 17, baseType: !160, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !152, file: !114, line: 18, baseType: !164, size: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 4096, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !152, file: !114, line: 19, baseType: !108, size: 64, offset: 256)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "fallback_cache", scope: !2, file: !114, line: 27, type: !171, isLocal: false, isDefinition: true)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 21, size: 320, elements: !172)
!172 = !{!173, !178, !199, !205, !210}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !171, file: !114, line: 22, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 288, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 9)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !171, file: !114, line: 23, baseType: !179, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_key", file: !89, line: 3, size: 320, elements: !181)
!181 = !{!182, !187, !192, !198}
!182 = !DIDerivedType(tag: DW_TAG_member, scope: !180, file: !89, line: 4, baseType: !183, size: 128)
!183 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !180, file: !89, line: 4, size: 128, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !183, file: !89, line: 5, baseType: !130, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "srcv6", scope: !183, file: !89, line: 6, baseType: !133, size: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, scope: !180, file: !89, line: 8, baseType: !188, size: 128, offset: 128)
!188 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !180, file: !89, line: 8, size: 128, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !188, file: !89, line: 9, baseType: !130, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "dstv6", scope: !188, file: !89, line: 10, baseType: !133, size: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, scope: !180, file: !89, line: 12, baseType: !193, size: 32, offset: 256)
!193 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !180, file: !89, line: 12, size: 32, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ports", scope: !193, file: !89, line: 13, baseType: !58, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "port16", scope: !193, file: !89, line: 14, baseType: !197, size: 32)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !82)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !180, file: !89, line: 16, baseType: !55, size: 8, offset: 288)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !171, file: !114, line: 24, baseType: !200, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_pos_lru", file: !89, line: 43, size: 128, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !201, file: !89, line: 44, baseType: !58, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !201, file: !89, line: 45, baseType: !95, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !171, file: !114, line: 25, baseType: !206, size: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32000, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 1000)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !171, file: !114, line: 26, baseType: !108, size: 64, offset: 256)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "ch_rings", scope: !2, file: !114, line: 34, type: !213, isLocal: false, isDefinition: true)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 28, size: 320, elements: !214)
!214 = !{!215, !216, !217, !218, !223}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !114, line: 29, baseType: !80, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !213, file: !114, line: 30, baseType: !85, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !213, file: !114, line: 31, baseType: !85, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !213, file: !114, line: 32, baseType: !219, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 1073758208, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 33554944)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !213, file: !114, line: 33, baseType: !108, size: 64, offset: 256)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "reals", scope: !2, file: !114, line: 41, type: !226, isLocal: false, isDefinition: true)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 35, size: 320, elements: !227)
!227 = !{!228, !229, !230, !240, !245}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !226, file: !114, line: 36, baseType: !80, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !226, file: !114, line: 37, baseType: !85, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !226, file: !114, line: 38, baseType: !231, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_definition", file: !89, line: 47, size: 160, elements: !233)
!233 = !{!234, !239}
!234 = !DIDerivedType(tag: DW_TAG_member, scope: !232, file: !89, line: 48, baseType: !235, size: 128)
!235 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !232, file: !89, line: 48, size: 128, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !235, file: !89, line: 49, baseType: !130, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "dstv6", scope: !235, file: !89, line: 50, baseType: !133, size: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !232, file: !89, line: 52, baseType: !55, size: 8, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !226, file: !114, line: 39, baseType: !241, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 131072, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 4096)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !226, file: !114, line: 40, baseType: !108, size: 64, offset: 256)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "reals_stats", scope: !2, file: !114, line: 48, type: !248, isLocal: false, isDefinition: true)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 42, size: 320, elements: !249)
!249 = !{!250, !253, !254, !260, !261}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !248, file: !114, line: 43, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 192, elements: !100)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !248, file: !114, line: 44, baseType: !85, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !248, file: !114, line: 45, baseType: !255, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lb_stats", file: !89, line: 54, size: 128, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !256, file: !89, line: 55, baseType: !95, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !256, file: !89, line: 56, baseType: !95, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !248, file: !114, line: 46, baseType: !241, size: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !248, file: !114, line: 47, baseType: !108, size: 64, offset: 256)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "stats", scope: !2, file: !114, line: 55, type: !264, isLocal: false, isDefinition: true)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 49, size: 320, elements: !265)
!265 = !{!266, !267, !268, !269, !274}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !264, file: !114, line: 50, baseType: !251, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !264, file: !114, line: 51, baseType: !85, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !264, file: !114, line: 52, baseType: !255, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !264, file: !114, line: 53, baseType: !270, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32768, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 1024)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !264, file: !114, line: 54, baseType: !108, size: 64, offset: 256)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "server_id_map", scope: !2, file: !114, line: 62, type: !277, isLocal: false, isDefinition: true)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 56, size: 320, elements: !278)
!278 = !{!279, !280, !281, !282, !287}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !277, file: !114, line: 57, baseType: !80, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !277, file: !114, line: 58, baseType: !85, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !277, file: !114, line: 59, baseType: !85, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !277, file: !114, line: 60, baseType: !283, size: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 536870848, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 16777214)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !277, file: !114, line: 61, baseType: !108, size: 64, offset: 256)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "flow_debug_maps", scope: !2, file: !290, line: 13, type: !291, isLocal: false, isDefinition: true)
!290 = !DIFile(filename: "./flow_debug_maps.h", directory: "/home/sayandes/github/hook-point-transformer/src/katran-test/extraction")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 7, size: 320, elements: !292)
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !291, file: !290, line: 8, baseType: !155, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !291, file: !290, line: 9, baseType: !160, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !291, file: !290, line: 10, baseType: !160, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !291, file: !290, line: 11, baseType: !164, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !291, file: !290, line: 12, baseType: !108, size: 64, offset: 256)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "decap_counters", scope: !2, file: !300, line: 19, type: !301, isLocal: false, isDefinition: true)
!300 = !DIFile(filename: "./decap_maps.h", directory: "/home/sayandes/github/hook-point-transformer/src/katran-test/extraction")
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !300, line: 13, size: 320, elements: !302)
!302 = !{!303, !304, !305, !312, !313}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !301, file: !300, line: 14, baseType: !251, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !301, file: !300, line: 15, baseType: !85, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !301, file: !300, line: 16, baseType: !306, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decap_stats", file: !300, line: 8, size: 192, elements: !308)
!308 = !{!309, !310, !311}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "decap_v4", scope: !307, file: !300, line: 9, baseType: !95, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "decap_v6", scope: !307, file: !300, line: 10, baseType: !95, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !307, file: !300, line: 11, baseType: !95, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !301, file: !300, line: 17, baseType: !270, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !301, file: !300, line: 18, baseType: !108, size: 64, offset: 256)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !316, line: 11, type: !317, isLocal: true, isDefinition: true)
!316 = !DIFile(filename: "./bpf_helpers.h", directory: "/home/sayandes/github/hook-point-transformer/src/katran-test/extraction")
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!44, !44, !44}
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "bpf_get_smp_processor_id", scope: !2, file: !316, line: 21, type: !322, isLocal: true, isDefinition: true)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!96}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !316, line: 18, type: !322, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !316, line: 12, type: !329, isLocal: true, isDefinition: true)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!72, !44, !44, !44, !96}
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "bpf_xdp_adjust_head", scope: !2, file: !316, line: 38, type: !334, isLocal: true, isDefinition: true)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!72, !44, !72}
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 32, elements: !134)
!338 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!339 = !{i32 7, !"Dwarf Version", i32 4}
!340 = !{i32 2, !"Debug Info Version", i32 3}
!341 = !{i32 1, !"wchar_size", i32 4}
!342 = !{!"clang version 10.0.0-4ubuntu1 "}
!343 = distinct !DISubprogram(name: "balancer_ingress", scope: !3, file: !3, line: 713, type: !344, scopeLine: 713, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !435)
!344 = !DISubroutineType(types: !345)
!345 = !{!72, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !36, line: 2934, size: 1408, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !365, !366, !367, !368, !369, !370, !371, !372, !373, !375, !376, !377, !378, !379, !412, !413, !414, !415}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !347, file: !36, line: 2935, baseType: !58, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !347, file: !36, line: 2936, baseType: !58, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !347, file: !36, line: 2937, baseType: !58, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !347, file: !36, line: 2938, baseType: !58, size: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !347, file: !36, line: 2939, baseType: !58, size: 32, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !347, file: !36, line: 2940, baseType: !58, size: 32, offset: 160)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !347, file: !36, line: 2941, baseType: !58, size: 32, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !347, file: !36, line: 2942, baseType: !58, size: 32, offset: 224)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !347, file: !36, line: 2943, baseType: !58, size: 32, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !347, file: !36, line: 2944, baseType: !58, size: 32, offset: 288)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !347, file: !36, line: 2945, baseType: !58, size: 32, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !347, file: !36, line: 2946, baseType: !58, size: 32, offset: 352)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !347, file: !36, line: 2947, baseType: !362, size: 160, offset: 384)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 160, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 5)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !347, file: !36, line: 2948, baseType: !58, size: 32, offset: 544)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !347, file: !36, line: 2949, baseType: !58, size: 32, offset: 576)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !347, file: !36, line: 2950, baseType: !58, size: 32, offset: 608)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !347, file: !36, line: 2951, baseType: !58, size: 32, offset: 640)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !347, file: !36, line: 2952, baseType: !58, size: 32, offset: 672)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !347, file: !36, line: 2955, baseType: !58, size: 32, offset: 704)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !347, file: !36, line: 2956, baseType: !58, size: 32, offset: 736)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !347, file: !36, line: 2957, baseType: !58, size: 32, offset: 768)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !347, file: !36, line: 2958, baseType: !374, size: 128, offset: 800)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 128, elements: !134)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !347, file: !36, line: 2959, baseType: !374, size: 128, offset: 928)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !347, file: !36, line: 2960, baseType: !58, size: 32, offset: 1056)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !347, file: !36, line: 2961, baseType: !58, size: 32, offset: 1088)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !347, file: !36, line: 2964, baseType: !58, size: 32, offset: 1120)
!379 = !DIDerivedType(tag: DW_TAG_member, scope: !347, file: !36, line: 2965, baseType: !380, size: 64, align: 64, offset: 1152)
!380 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !347, file: !36, line: 2965, size: 64, align: 64, elements: !381)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !380, file: !36, line: 2965, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !36, line: 3515, size: 448, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !395, !396, !397, !410, !411}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !384, file: !36, line: 3516, baseType: !46, size: 16)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !384, file: !36, line: 3517, baseType: !46, size: 16, offset: 16)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !384, file: !36, line: 3518, baseType: !46, size: 16, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !384, file: !36, line: 3519, baseType: !55, size: 8, offset: 48)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !384, file: !36, line: 3520, baseType: !55, size: 8, offset: 56)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !384, file: !36, line: 3521, baseType: !55, size: 8, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !384, file: !36, line: 3522, baseType: !55, size: 8, offset: 72)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !384, file: !36, line: 3523, baseType: !394, size: 16, offset: 80)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !131, line: 25, baseType: !46)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !384, file: !36, line: 3524, baseType: !394, size: 16, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !384, file: !36, line: 3525, baseType: !394, size: 16, offset: 112)
!397 = !DIDerivedType(tag: DW_TAG_member, scope: !384, file: !36, line: 3526, baseType: !398, size: 256, offset: 128)
!398 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !384, file: !36, line: 3526, size: 256, elements: !399)
!399 = !{!400, !405}
!400 = !DIDerivedType(tag: DW_TAG_member, scope: !398, file: !36, line: 3527, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !398, file: !36, line: 3527, size: 64, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !401, file: !36, line: 3528, baseType: !130, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !401, file: !36, line: 3529, baseType: !130, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, scope: !398, file: !36, line: 3531, baseType: !406, size: 256)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !398, file: !36, line: 3531, size: 256, elements: !407)
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !406, file: !36, line: 3532, baseType: !374, size: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !406, file: !36, line: 3533, baseType: !374, size: 128, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !384, file: !36, line: 3536, baseType: !58, size: 32, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !384, file: !36, line: 3537, baseType: !130, size: 32, offset: 416)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !347, file: !36, line: 2966, baseType: !95, size: 64, offset: 1216)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !347, file: !36, line: 2967, baseType: !58, size: 32, offset: 1280)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !347, file: !36, line: 2968, baseType: !58, size: 32, offset: 1312)
!415 = !DIDerivedType(tag: DW_TAG_member, scope: !347, file: !36, line: 2969, baseType: !416, size: 64, align: 64, offset: 1344)
!416 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !347, file: !36, line: 2969, size: 64, align: 64, elements: !417)
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !416, file: !36, line: 2969, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !36, line: 3022, size: 608, elements: !421)
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !420, file: !36, line: 3023, baseType: !58, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !420, file: !36, line: 3024, baseType: !58, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !420, file: !36, line: 3025, baseType: !58, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !420, file: !36, line: 3026, baseType: !58, size: 32, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !420, file: !36, line: 3027, baseType: !58, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !420, file: !36, line: 3028, baseType: !58, size: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !420, file: !36, line: 3030, baseType: !58, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !420, file: !36, line: 3031, baseType: !374, size: 128, offset: 224)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !420, file: !36, line: 3032, baseType: !58, size: 32, offset: 352)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !420, file: !36, line: 3033, baseType: !58, size: 32, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !420, file: !36, line: 3034, baseType: !58, size: 32, offset: 416)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !420, file: !36, line: 3035, baseType: !374, size: 128, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !420, file: !36, line: 3036, baseType: !58, size: 32, offset: 576)
!435 = !{!436, !437, !438, !439, !448, !449}
!436 = !DILocalVariable(name: "ctx", arg: 1, scope: !343, file: !3, line: 713, type: !346)
!437 = !DILocalVariable(name: "data", scope: !343, file: !3, line: 714, type: !44)
!438 = !DILocalVariable(name: "data_end", scope: !343, file: !3, line: 715, type: !44)
!439 = !DILocalVariable(name: "eth", scope: !343, file: !3, line: 716, type: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !442, line: 163, size: 112, elements: !443)
!442 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!443 = !{!444, !446, !447}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !441, file: !442, line: 164, baseType: !445, size: 48)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 48, elements: !100)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !441, file: !442, line: 165, baseType: !445, size: 48, offset: 48)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !441, file: !442, line: 166, baseType: !394, size: 16, offset: 96)
!448 = !DILocalVariable(name: "eth_proto", scope: !343, file: !3, line: 717, type: !58)
!449 = !DILocalVariable(name: "nh_off", scope: !343, file: !3, line: 718, type: !58)
!450 = !DILocalVariable(name: "new_dst_lru", scope: !451, file: !3, line: 350, type: !201)
!451 = distinct !DISubprogram(name: "get_packet_dst", scope: !3, file: !3, line: 349, type: !452, scopeLine: 349, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !463)
!452 = !DISubroutineType(types: !453)
!453 = !{!454, !455, !456, !139, !454, !44}
!454 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_description", file: !89, line: 18, size: 384, elements: !458)
!458 = !{!459, !460, !461, !462}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !457, file: !89, line: 19, baseType: !180, size: 320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "real_index", scope: !457, file: !89, line: 20, baseType: !58, size: 32, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !457, file: !89, line: 21, baseType: !55, size: 8, offset: 352)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !457, file: !89, line: 22, baseType: !55, size: 8, offset: 360)
!463 = !{!464, !465, !466, !467, !468, !450, !469, !470, !471, !472, !473, !474, !475}
!464 = !DILocalVariable(name: "real", arg: 1, scope: !451, file: !3, line: 349, type: !455)
!465 = !DILocalVariable(name: "pckt", arg: 2, scope: !451, file: !3, line: 349, type: !456)
!466 = !DILocalVariable(name: "vip_info", arg: 3, scope: !451, file: !3, line: 349, type: !139)
!467 = !DILocalVariable(name: "is_ipv6", arg: 4, scope: !451, file: !3, line: 349, type: !454)
!468 = !DILocalVariable(name: "lru_map", arg: 5, scope: !451, file: !3, line: 349, type: !44)
!469 = !DILocalVariable(name: "under_flood", scope: !451, file: !3, line: 351, type: !454)
!470 = !DILocalVariable(name: "src_found", scope: !451, file: !3, line: 352, type: !454)
!471 = !DILocalVariable(name: "real_pos", scope: !451, file: !3, line: 353, type: !85)
!472 = !DILocalVariable(name: "cur_time", scope: !451, file: !3, line: 354, type: !95)
!473 = !DILocalVariable(name: "hash", scope: !451, file: !3, line: 355, type: !58)
!474 = !DILocalVariable(name: "key", scope: !451, file: !3, line: 356, type: !58)
!475 = !DILocalVariable(name: "hash_16bytes", scope: !476, file: !3, line: 390, type: !454)
!476 = distinct !DILexicalBlock(scope: !477, file: !3, line: 389, column: 21)
!477 = distinct !DILexicalBlock(scope: !451, file: !3, line: 389, column: 9)
!478 = !DILocation(line: 350, column: 25, scope: !451, inlinedAt: !479)
!479 = distinct !DILocation(line: 670, column: 18, scope: !480, inlinedAt: !527)
!480 = distinct !DILexicalBlock(scope: !481, file: !3, line: 670, column: 17)
!481 = distinct !DILexicalBlock(scope: !482, file: !3, line: 655, column: 19)
!482 = distinct !DILexicalBlock(scope: !483, file: !3, line: 655, column: 13)
!483 = distinct !DILexicalBlock(scope: !484, file: !3, line: 614, column: 15)
!484 = distinct !DILexicalBlock(scope: !485, file: !3, line: 614, column: 9)
!485 = distinct !DISubprogram(name: "process_packet", scope: !3, file: !3, line: 470, type: !486, scopeLine: 470, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !488)
!486 = !DISubroutineType(types: !487)
!487 = !{!72, !346, !95, !454}
!488 = !{!489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !511, !512, !513, !516, !517, !518, !519, !522, !523, !526}
!489 = !DILocalVariable(name: "xdp", arg: 1, scope: !485, file: !3, line: 470, type: !346)
!490 = !DILocalVariable(name: "off", arg: 2, scope: !485, file: !3, line: 470, type: !95)
!491 = !DILocalVariable(name: "is_ipv6", arg: 3, scope: !485, file: !3, line: 470, type: !454)
!492 = !DILocalVariable(name: "data", scope: !485, file: !3, line: 471, type: !44)
!493 = !DILocalVariable(name: "data_end", scope: !485, file: !3, line: 472, type: !44)
!494 = !DILocalVariable(name: "cval", scope: !485, file: !3, line: 473, type: !87)
!495 = !DILocalVariable(name: "dst", scope: !485, file: !3, line: 474, type: !231)
!496 = !DILocalVariable(name: "pckt", scope: !485, file: !3, line: 475, type: !457)
!497 = !DILocalVariable(name: "vip", scope: !485, file: !3, line: 476, type: !124)
!498 = !DILocalVariable(name: "vip_info", scope: !485, file: !3, line: 477, type: !139)
!499 = !DILocalVariable(name: "data_stats", scope: !485, file: !3, line: 478, type: !255)
!500 = !DILocalVariable(name: "iph_len", scope: !485, file: !3, line: 479, type: !95)
!501 = !DILocalVariable(name: "protocol", scope: !485, file: !3, line: 480, type: !55)
!502 = !DILocalVariable(name: "original_sport", scope: !485, file: !3, line: 481, type: !46)
!503 = !DILocalVariable(name: "action", scope: !485, file: !3, line: 482, type: !72)
!504 = !DILocalVariable(name: "vip_num", scope: !485, file: !3, line: 483, type: !58)
!505 = !DILocalVariable(name: "mac_addr_pos", scope: !485, file: !3, line: 484, type: !58)
!506 = !DILocalVariable(name: "pkt_bytes", scope: !485, file: !3, line: 485, type: !46)
!507 = !DILocalVariable(name: "stats_key", scope: !485, file: !3, line: 570, type: !58)
!508 = !DILocalVariable(name: "quic_stats_key", scope: !509, file: !3, line: 577, type: !58)
!509 = distinct !DILexicalBlock(scope: !510, file: !3, line: 576, column: 41)
!510 = distinct !DILexicalBlock(scope: !485, file: !3, line: 576, column: 9)
!511 = !DILocalVariable(name: "quic_stats", scope: !509, file: !3, line: 578, type: !255)
!512 = !DILocalVariable(name: "real_index", scope: !509, file: !3, line: 582, type: !72)
!513 = !DILocalVariable(name: "key", scope: !514, file: !3, line: 586, type: !58)
!514 = distinct !DILexicalBlock(scope: !515, file: !3, line: 584, column: 29)
!515 = distinct !DILexicalBlock(scope: !509, file: !3, line: 584, column: 13)
!516 = !DILocalVariable(name: "real_pos", scope: !514, file: !3, line: 587, type: !85)
!517 = !DILocalVariable(name: "cpu_num", scope: !483, file: !3, line: 618, type: !58)
!518 = !DILocalVariable(name: "lru_map", scope: !483, file: !3, line: 619, type: !44)
!519 = !DILocalVariable(name: "lru_stats_key", scope: !520, file: !3, line: 622, type: !58)
!520 = distinct !DILexicalBlock(scope: !521, file: !3, line: 620, column: 23)
!521 = distinct !DILexicalBlock(scope: !483, file: !3, line: 620, column: 13)
!522 = !DILocalVariable(name: "lru_stats", scope: !520, file: !3, line: 623, type: !255)
!523 = !DILocalVariable(name: "lru_stats_key", scope: !524, file: !3, line: 657, type: !58)
!524 = distinct !DILexicalBlock(scope: !525, file: !3, line: 656, column: 49)
!525 = distinct !DILexicalBlock(scope: !481, file: !3, line: 656, column: 17)
!526 = !DILocalVariable(name: "lru_stats", scope: !524, file: !3, line: 658, type: !255)
!527 = distinct !DILocation(line: 728, column: 16, scope: !528)
!528 = distinct !DILexicalBlock(scope: !529, file: !3, line: 727, column: 42)
!529 = distinct !DILexicalBlock(scope: !530, file: !3, line: 727, column: 14)
!530 = distinct !DILexicalBlock(scope: !343, file: !3, line: 724, column: 9)
!531 = !DILocalVariable(name: "tmp_addr", scope: !532, file: !533, line: 64, type: !133)
!532 = distinct !DISubprogram(name: "send_icmp6_reply", scope: !533, file: !533, line: 61, type: !534, scopeLine: 61, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !536)
!533 = !DIFile(filename: "./handle_icmp.h", directory: "/home/sayandes/github/hook-point-transformer/src/katran-test/extraction")
!534 = !DISubroutineType(types: !535)
!535 = !{!72, !44, !44}
!536 = !{!537, !538, !539, !566, !531, !607}
!537 = !DILocalVariable(name: "data", arg: 1, scope: !532, file: !533, line: 61, type: !44)
!538 = !DILocalVariable(name: "data_end", arg: 2, scope: !532, file: !533, line: 61, type: !44)
!539 = !DILocalVariable(name: "ip6h", scope: !532, file: !533, line: 62, type: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !542, line: 116, size: 320, elements: !543)
!542 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "")
!543 = !{!544, !545, !546, !550, !551, !552, !553, !565}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !541, file: !542, line: 118, baseType: !55, size: 4, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !541, file: !542, line: 119, baseType: !55, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !541, file: !542, line: 126, baseType: !547, size: 24, offset: 8)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 24, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 3)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !541, file: !542, line: 128, baseType: !394, size: 16, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !541, file: !542, line: 129, baseType: !55, size: 8, offset: 48)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !541, file: !542, line: 130, baseType: !55, size: 8, offset: 56)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !541, file: !542, line: 132, baseType: !554, size: 128, offset: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !555, line: 33, size: 128, elements: !556)
!555 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !554, file: !555, line: 40, baseType: !558, size: 128)
!558 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !554, file: !555, line: 34, size: 128, elements: !559)
!559 = !{!560, !562, !564}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !558, file: !555, line: 35, baseType: !561, size: 128)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 128, elements: !105)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !558, file: !555, line: 37, baseType: !563, size: 128)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 128, elements: !62)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !558, file: !555, line: 38, baseType: !133, size: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !541, file: !542, line: 133, baseType: !554, size: 128, offset: 192)
!566 = !DILocalVariable(name: "icmp_hdr", scope: !532, file: !533, line: 63, type: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6hdr", file: !569, line: 8, size: 64, elements: !570)
!569 = !DIFile(filename: "/usr/include/linux/icmpv6.h", directory: "")
!570 = !{!571, !572, !573, !575}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_type", scope: !568, file: !569, line: 10, baseType: !55, size: 8)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_code", scope: !568, file: !569, line: 11, baseType: !55, size: 8, offset: 8)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_cksum", scope: !568, file: !569, line: 12, baseType: !574, size: 16, offset: 16)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !131, line: 31, baseType: !46)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_dataun", scope: !568, file: !569, line: 63, baseType: !576, size: 32, offset: 32)
!576 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !568, file: !569, line: 15, size: 32, elements: !577)
!577 = !{!578, !580, !582, !584, !589, !597}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "un_data32", scope: !576, file: !569, line: 16, baseType: !579, size: 32)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 32, elements: !120)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "un_data16", scope: !576, file: !569, line: 17, baseType: !581, size: 32)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 32, elements: !82)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "un_data8", scope: !576, file: !569, line: 18, baseType: !583, size: 32)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !134)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "u_echo", scope: !576, file: !569, line: 23, baseType: !585, size: 32)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_echo", file: !569, line: 20, size: 32, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !585, file: !569, line: 21, baseType: !394, size: 16)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !585, file: !569, line: 22, baseType: !394, size: 16, offset: 16)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_advt", scope: !576, file: !569, line: 40, baseType: !590, size: 32)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_advt", file: !569, line: 25, size: 32, elements: !591)
!591 = !{!592, !593, !594, !595, !596}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !590, file: !569, line: 27, baseType: !58, size: 5, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !590, file: !569, line: 28, baseType: !58, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "solicited", scope: !590, file: !569, line: 29, baseType: !58, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "router", scope: !590, file: !569, line: 30, baseType: !58, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !590, file: !569, line: 31, baseType: !58, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_ra", scope: !576, file: !569, line: 61, baseType: !598, size: 32)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_ra", file: !569, line: 42, size: 32, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !606}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !598, file: !569, line: 43, baseType: !55, size: 8)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !598, file: !569, line: 45, baseType: !55, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "router_pref", scope: !598, file: !569, line: 46, baseType: !55, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "home_agent", scope: !598, file: !569, line: 47, baseType: !55, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 8)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !598, file: !569, line: 48, baseType: !55, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 8)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "managed", scope: !598, file: !569, line: 49, baseType: !55, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rt_lifetime", scope: !598, file: !569, line: 60, baseType: !394, size: 16, offset: 16)
!607 = !DILocalVariable(name: "off", scope: !532, file: !533, line: 65, type: !95)
!608 = !DILocation(line: 64, column: 12, scope: !532, inlinedAt: !609)
!609 = distinct !DILocation(line: 193, column: 16, scope: !610, inlinedAt: !622)
!610 = distinct !DILexicalBlock(scope: !611, file: !533, line: 192, column: 54)
!611 = distinct !DILexicalBlock(scope: !612, file: !533, line: 192, column: 9)
!612 = distinct !DISubprogram(name: "parse_icmpv6", scope: !533, file: !533, line: 185, type: !613, scopeLine: 185, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !615)
!613 = !DISubroutineType(types: !614)
!614 = !{!72, !44, !44, !95, !456}
!615 = !{!616, !617, !618, !619, !620, !621}
!616 = !DILocalVariable(name: "data", arg: 1, scope: !612, file: !533, line: 185, type: !44)
!617 = !DILocalVariable(name: "data_end", arg: 2, scope: !612, file: !533, line: 185, type: !44)
!618 = !DILocalVariable(name: "off", arg: 3, scope: !612, file: !533, line: 185, type: !95)
!619 = !DILocalVariable(name: "pckt", arg: 4, scope: !612, file: !533, line: 185, type: !456)
!620 = !DILocalVariable(name: "icmp_hdr", scope: !612, file: !533, line: 186, type: !567)
!621 = !DILocalVariable(name: "ip6h", scope: !612, file: !533, line: 187, type: !540)
!622 = distinct !DILocation(line: 112, column: 22, scope: !623, inlinedAt: !659)
!623 = distinct !DILexicalBlock(scope: !624, file: !3, line: 111, column: 47)
!624 = distinct !DILexicalBlock(scope: !625, file: !3, line: 111, column: 18)
!625 = distinct !DILexicalBlock(scope: !626, file: !3, line: 108, column: 13)
!626 = distinct !DILexicalBlock(scope: !627, file: !3, line: 96, column: 18)
!627 = distinct !DILexicalBlock(scope: !628, file: !3, line: 96, column: 9)
!628 = distinct !DISubprogram(name: "process_l3_headers", scope: !3, file: !3, line: 91, type: !629, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !632)
!629 = !DISubroutineType(types: !630)
!630 = !{!72, !456, !631, !95, !49, !44, !44, !454}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !658}
!633 = !DILocalVariable(name: "pckt", arg: 1, scope: !628, file: !3, line: 91, type: !456)
!634 = !DILocalVariable(name: "protocol", arg: 2, scope: !628, file: !3, line: 91, type: !631)
!635 = !DILocalVariable(name: "off", arg: 3, scope: !628, file: !3, line: 91, type: !95)
!636 = !DILocalVariable(name: "pkt_bytes", arg: 4, scope: !628, file: !3, line: 91, type: !49)
!637 = !DILocalVariable(name: "data", arg: 5, scope: !628, file: !3, line: 91, type: !44)
!638 = !DILocalVariable(name: "data_end", arg: 6, scope: !628, file: !3, line: 91, type: !44)
!639 = !DILocalVariable(name: "is_ipv6", arg: 7, scope: !628, file: !3, line: 91, type: !454)
!640 = !DILocalVariable(name: "iph_len", scope: !628, file: !3, line: 92, type: !95)
!641 = !DILocalVariable(name: "action", scope: !628, file: !3, line: 93, type: !72)
!642 = !DILocalVariable(name: "iph", scope: !628, file: !3, line: 94, type: !643)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !645, line: 86, size: 160, elements: !646)
!645 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !644, file: !645, line: 88, baseType: !55, size: 4, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !644, file: !645, line: 89, baseType: !55, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !644, file: !645, line: 96, baseType: !55, size: 8, offset: 8)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !644, file: !645, line: 97, baseType: !394, size: 16, offset: 16)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !644, file: !645, line: 98, baseType: !394, size: 16, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !644, file: !645, line: 99, baseType: !394, size: 16, offset: 48)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !644, file: !645, line: 100, baseType: !55, size: 8, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !644, file: !645, line: 101, baseType: !55, size: 8, offset: 72)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !644, file: !645, line: 102, baseType: !574, size: 16, offset: 80)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !644, file: !645, line: 103, baseType: !130, size: 32, offset: 96)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !644, file: !645, line: 104, baseType: !130, size: 32, offset: 128)
!658 = !DILocalVariable(name: "ip6h", scope: !628, file: !3, line: 95, type: !540)
!659 = distinct !DILocation(line: 486, column: 14, scope: !485, inlinedAt: !527)
!660 = !DILocation(line: 475, column: 31, scope: !485, inlinedAt: !527)
!661 = !DILocation(line: 476, column: 27, scope: !485, inlinedAt: !527)
!662 = !DILocation(line: 350, column: 25, scope: !451, inlinedAt: !663)
!663 = distinct !DILocation(line: 670, column: 18, scope: !480, inlinedAt: !664)
!664 = distinct !DILocation(line: 725, column: 16, scope: !665)
!665 = distinct !DILexicalBlock(scope: !530, file: !3, line: 724, column: 35)
!666 = !DILocalVariable(name: "tmp_mac", scope: !667, file: !533, line: 20, type: !445)
!667 = distinct !DISubprogram(name: "swap_mac_and_send", scope: !533, file: !533, line: 18, type: !534, scopeLine: 18, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !668)
!668 = !{!669, !670, !671, !666}
!669 = !DILocalVariable(name: "data", arg: 1, scope: !667, file: !533, line: 18, type: !44)
!670 = !DILocalVariable(name: "data_end", arg: 2, scope: !667, file: !533, line: 18, type: !44)
!671 = !DILocalVariable(name: "eth", scope: !667, file: !533, line: 19, type: !440)
!672 = !DILocation(line: 20, column: 19, scope: !667, inlinedAt: !673)
!673 = distinct !DILocation(line: 58, column: 12, scope: !674, inlinedAt: !705)
!674 = distinct !DISubprogram(name: "send_icmp_reply", scope: !533, file: !533, line: 36, type: !534, scopeLine: 36, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !675)
!675 = !{!676, !677, !678, !679, !702, !703, !704}
!676 = !DILocalVariable(name: "data", arg: 1, scope: !674, file: !533, line: 36, type: !44)
!677 = !DILocalVariable(name: "data_end", arg: 2, scope: !674, file: !533, line: 36, type: !44)
!678 = !DILocalVariable(name: "iph", scope: !674, file: !533, line: 37, type: !643)
!679 = !DILocalVariable(name: "icmp_hdr", scope: !674, file: !533, line: 38, type: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr", file: !682, line: 69, size: 64, elements: !683)
!682 = !DIFile(filename: "/usr/include/linux/icmp.h", directory: "")
!683 = !{!684, !685, !686, !687}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !681, file: !682, line: 70, baseType: !55, size: 8)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !681, file: !682, line: 71, baseType: !55, size: 8, offset: 8)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !681, file: !682, line: 72, baseType: !574, size: 16, offset: 16)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !681, file: !682, line: 84, baseType: !688, size: 32, offset: 32)
!688 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !681, file: !682, line: 73, size: 32, elements: !689)
!689 = !{!690, !695, !696, !701}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !688, file: !682, line: 77, baseType: !691, size: 32)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !688, file: !682, line: 74, size: 32, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !691, file: !682, line: 75, baseType: !394, size: 16)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !691, file: !682, line: 76, baseType: !394, size: 16, offset: 16)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "gateway", scope: !688, file: !682, line: 78, baseType: !130, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !688, file: !682, line: 82, baseType: !697, size: 32)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !688, file: !682, line: 79, size: 32, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !697, file: !682, line: 80, baseType: !394, size: 16)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !697, file: !682, line: 81, baseType: !394, size: 16, offset: 16)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !688, file: !682, line: 83, baseType: !583, size: 32)
!702 = !DILocalVariable(name: "tmp_addr", scope: !674, file: !533, line: 39, type: !58)
!703 = !DILocalVariable(name: "csum", scope: !674, file: !533, line: 40, type: !95)
!704 = !DILocalVariable(name: "off", scope: !674, file: !533, line: 41, type: !95)
!705 = distinct !DILocation(line: 218, column: 16, scope: !706, inlinedAt: !716)
!706 = distinct !DILexicalBlock(scope: !707, file: !533, line: 217, column: 38)
!707 = distinct !DILexicalBlock(scope: !708, file: !533, line: 217, column: 9)
!708 = distinct !DISubprogram(name: "parse_icmp", scope: !533, file: !533, line: 210, type: !613, scopeLine: 210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !709)
!709 = !{!710, !711, !712, !713, !714, !715}
!710 = !DILocalVariable(name: "data", arg: 1, scope: !708, file: !533, line: 210, type: !44)
!711 = !DILocalVariable(name: "data_end", arg: 2, scope: !708, file: !533, line: 210, type: !44)
!712 = !DILocalVariable(name: "off", arg: 3, scope: !708, file: !533, line: 210, type: !95)
!713 = !DILocalVariable(name: "pckt", arg: 4, scope: !708, file: !533, line: 210, type: !456)
!714 = !DILocalVariable(name: "icmp_hdr", scope: !708, file: !533, line: 211, type: !680)
!715 = !DILocalVariable(name: "iph", scope: !708, file: !533, line: 212, type: !643)
!716 = distinct !DILocation(line: 139, column: 22, scope: !717, inlinedAt: !659)
!717 = distinct !DILexicalBlock(scope: !718, file: !3, line: 138, column: 40)
!718 = distinct !DILexicalBlock(scope: !719, file: !3, line: 138, column: 13)
!719 = distinct !DILexicalBlock(scope: !627, file: !3, line: 122, column: 10)
!720 = !DILocation(line: 20, column: 19, scope: !667, inlinedAt: !721)
!721 = distinct !DILocation(line: 79, column: 12, scope: !532, inlinedAt: !609)
!722 = !DILocation(line: 20, column: 19, scope: !667, inlinedAt: !723)
!723 = distinct !DILocation(line: 58, column: 12, scope: !674, inlinedAt: !724)
!724 = distinct !DILocation(line: 218, column: 16, scope: !706, inlinedAt: !725)
!725 = distinct !DILocation(line: 139, column: 22, scope: !717, inlinedAt: !726)
!726 = distinct !DILocation(line: 486, column: 14, scope: !485, inlinedAt: !664)
!727 = !DILocation(line: 20, column: 19, scope: !667, inlinedAt: !728)
!728 = distinct !DILocation(line: 79, column: 12, scope: !532, inlinedAt: !729)
!729 = distinct !DILocation(line: 193, column: 16, scope: !610, inlinedAt: !730)
!730 = distinct !DILocation(line: 112, column: 22, scope: !623, inlinedAt: !726)
!731 = !DILocation(line: 475, column: 31, scope: !485, inlinedAt: !664)
!732 = !DILocation(line: 476, column: 27, scope: !485, inlinedAt: !664)
!733 = !DILocation(line: 0, scope: !343)
!734 = !DILocation(line: 714, column: 39, scope: !343)
!735 = !{!736, !737, i64 76}
!736 = !{!"__sk_buff", !737, i64 0, !737, i64 4, !737, i64 8, !737, i64 12, !737, i64 16, !737, i64 20, !737, i64 24, !737, i64 28, !737, i64 32, !737, i64 36, !737, i64 40, !737, i64 44, !738, i64 48, !737, i64 68, !737, i64 72, !737, i64 76, !737, i64 80, !737, i64 84, !737, i64 88, !737, i64 92, !737, i64 96, !738, i64 100, !738, i64 116, !737, i64 132, !737, i64 136, !737, i64 140, !738, i64 144, !740, i64 152, !737, i64 160, !737, i64 164, !738, i64 168}
!737 = !{!"int", !738, i64 0}
!738 = !{!"omnipotent char", !739, i64 0}
!739 = !{!"Simple C/C++ TBAA"}
!740 = !{!"long long", !738, i64 0}
!741 = !DILocation(line: 714, column: 27, scope: !343)
!742 = !DILocation(line: 714, column: 18, scope: !343)
!743 = !DILocation(line: 715, column: 43, scope: !343)
!744 = !{!736, !737, i64 80}
!745 = !DILocation(line: 715, column: 31, scope: !343)
!746 = !DILocation(line: 715, column: 22, scope: !343)
!747 = !DILocation(line: 720, column: 14, scope: !748)
!748 = distinct !DILexicalBlock(scope: !343, file: !3, line: 720, column: 9)
!749 = !DILocation(line: 720, column: 23, scope: !748)
!750 = !DILocation(line: 720, column: 9, scope: !343)
!751 = !DILocation(line: 723, column: 22, scope: !343)
!752 = !{!736, !737, i64 16}
!753 = !DILocation(line: 724, column: 9, scope: !343)
!754 = !DILocation(line: 0, scope: !485, inlinedAt: !664)
!755 = !DILocation(line: 475, column: 5, scope: !485, inlinedAt: !664)
!756 = !DILocation(line: 476, column: 5, scope: !485, inlinedAt: !664)
!757 = !DILocation(line: 483, column: 5, scope: !485, inlinedAt: !664)
!758 = !DILocation(line: 484, column: 5, scope: !485, inlinedAt: !664)
!759 = !DILocation(line: 484, column: 11, scope: !485, inlinedAt: !664)
!760 = !{!737, !737, i64 0}
!761 = !DILocation(line: 0, scope: !628, inlinedAt: !726)
!762 = !DILocation(line: 124, column: 17, scope: !763, inlinedAt: !726)
!763 = distinct !DILexicalBlock(scope: !719, file: !3, line: 124, column: 13)
!764 = !DILocation(line: 124, column: 21, scope: !763, inlinedAt: !726)
!765 = !DILocation(line: 124, column: 13, scope: !719, inlinedAt: !726)
!766 = !DILocation(line: 127, column: 18, scope: !767, inlinedAt: !726)
!767 = distinct !DILexicalBlock(scope: !719, file: !3, line: 127, column: 13)
!768 = !DILocation(line: 127, column: 22, scope: !767, inlinedAt: !726)
!769 = !DILocation(line: 127, column: 13, scope: !719, inlinedAt: !726)
!770 = !DILocation(line: 130, column: 26, scope: !719, inlinedAt: !726)
!771 = !{!772, !738, i64 1}
!772 = !{!"iphdr", !738, i64 0, !738, i64 0, !738, i64 1, !773, i64 2, !773, i64 4, !773, i64 6, !738, i64 8, !738, i64 9, !773, i64 10, !737, i64 12, !737, i64 16}
!773 = !{!"short", !738, i64 0}
!774 = !DILocation(line: 130, column: 15, scope: !719, inlinedAt: !726)
!775 = !DILocation(line: 130, column: 19, scope: !719, inlinedAt: !726)
!776 = !{!777, !738, i64 45}
!777 = !{!"packet_description", !778, i64 0, !737, i64 40, !738, i64 44, !738, i64 45}
!778 = !{!"flow_key", !738, i64 0, !738, i64 16, !738, i64 32, !738, i64 36}
!779 = !DILocation(line: 131, column: 26, scope: !719, inlinedAt: !726)
!780 = !{!772, !738, i64 9}
!781 = !DILocation(line: 132, column: 20, scope: !719, inlinedAt: !726)
!782 = !DILocation(line: 132, column: 26, scope: !719, inlinedAt: !726)
!783 = !{!777, !738, i64 36}
!784 = !DILocation(line: 133, column: 22, scope: !719, inlinedAt: !726)
!785 = !{!772, !773, i64 2}
!786 = !DILocation(line: 135, column: 18, scope: !787, inlinedAt: !726)
!787 = distinct !DILexicalBlock(scope: !719, file: !3, line: 135, column: 13)
!788 = !{!772, !773, i64 6}
!789 = !DILocation(line: 135, column: 27, scope: !787, inlinedAt: !726)
!790 = !DILocation(line: 135, column: 13, scope: !719, inlinedAt: !726)
!791 = !DILocation(line: 138, column: 23, scope: !718, inlinedAt: !726)
!792 = !DILocation(line: 138, column: 13, scope: !719, inlinedAt: !726)
!793 = !DILocation(line: 0, scope: !708, inlinedAt: !725)
!794 = !DILocation(line: 214, column: 18, scope: !795, inlinedAt: !725)
!795 = distinct !DILexicalBlock(scope: !708, file: !533, line: 214, column: 9)
!796 = !DILocation(line: 214, column: 22, scope: !795, inlinedAt: !725)
!797 = !DILocation(line: 214, column: 9, scope: !708, inlinedAt: !725)
!798 = !DILocation(line: 217, column: 19, scope: !707, inlinedAt: !725)
!799 = !{!800, !738, i64 0}
!800 = !{!"icmphdr", !738, i64 0, !738, i64 1, !773, i64 2, !738, i64 4}
!801 = !DILocation(line: 217, column: 9, scope: !708, inlinedAt: !725)
!802 = !DILocation(line: 0, scope: !674, inlinedAt: !724)
!803 = !DILocation(line: 49, column: 20, scope: !674, inlinedAt: !724)
!804 = !DILocation(line: 50, column: 15, scope: !674, inlinedAt: !724)
!805 = !DILocation(line: 50, column: 24, scope: !674, inlinedAt: !724)
!806 = !{!800, !773, i64 2}
!807 = !DILocation(line: 51, column: 10, scope: !674, inlinedAt: !724)
!808 = !DILocation(line: 51, column: 14, scope: !674, inlinedAt: !724)
!809 = !{!772, !738, i64 8}
!810 = !DILocation(line: 52, column: 21, scope: !674, inlinedAt: !724)
!811 = !{!772, !737, i64 16}
!812 = !DILocation(line: 53, column: 23, scope: !674, inlinedAt: !724)
!813 = !{!772, !737, i64 12}
!814 = !DILocation(line: 53, column: 16, scope: !674, inlinedAt: !724)
!815 = !DILocation(line: 54, column: 16, scope: !674, inlinedAt: !724)
!816 = !DILocation(line: 55, column: 10, scope: !674, inlinedAt: !724)
!817 = !DILocalVariable(name: "iph", arg: 1, scope: !818, file: !819, line: 34, type: !44)
!818 = distinct !DISubprogram(name: "ipv4_csum_inline", scope: !819, file: !819, line: 34, type: !820, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !823)
!819 = !DIFile(filename: "./csum_helpers.h", directory: "/home/sayandes/github/hook-point-transformer/src/katran-test/extraction")
!820 = !DISubroutineType(types: !821)
!821 = !{null, !44, !822}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!823 = !{!817, !824, !825, !826}
!824 = !DILocalVariable(name: "csum", arg: 2, scope: !818, file: !819, line: 34, type: !822)
!825 = !DILocalVariable(name: "next_iph_u16", scope: !818, file: !819, line: 35, type: !49)
!826 = !DILocalVariable(name: "i", scope: !827, file: !819, line: 37, type: !72)
!827 = distinct !DILexicalBlock(scope: !818, file: !819, line: 37, column: 5)
!828 = !DILocation(line: 0, scope: !818, inlinedAt: !829)
!829 = distinct !DILocation(line: 56, column: 5, scope: !674, inlinedAt: !724)
!830 = !DILocation(line: 35, column: 27, scope: !818, inlinedAt: !829)
!831 = !DILocation(line: 0, scope: !827, inlinedAt: !829)
!832 = !DILocation(line: 38, column: 18, scope: !833, inlinedAt: !829)
!833 = distinct !DILexicalBlock(scope: !834, file: !819, line: 37, column: 58)
!834 = distinct !DILexicalBlock(scope: !827, file: !819, line: 37, column: 5)
!835 = !{!773, !773, i64 0}
!836 = !DILocation(line: 38, column: 31, scope: !833, inlinedAt: !829)
!837 = !DILocation(line: 38, column: 15, scope: !833, inlinedAt: !829)
!838 = !DILocalVariable(name: "i", scope: !839, file: !819, line: 16, type: !72)
!839 = distinct !DISubprogram(name: "csum_fold_helper", scope: !819, file: !819, line: 15, type: !840, scopeLine: 15, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !842)
!840 = !DISubroutineType(types: !841)
!841 = !{!46, !95}
!842 = !{!843, !838}
!843 = !DILocalVariable(name: "csum", arg: 1, scope: !839, file: !819, line: 15, type: !95)
!844 = !DILocation(line: 0, scope: !839, inlinedAt: !845)
!845 = distinct !DILocation(line: 40, column: 13, scope: !818, inlinedAt: !829)
!846 = !DILocation(line: 19, column: 18, scope: !847, inlinedAt: !845)
!847 = distinct !DILexicalBlock(scope: !848, file: !819, line: 19, column: 13)
!848 = distinct !DILexicalBlock(scope: !849, file: !819, line: 18, column: 29)
!849 = distinct !DILexicalBlock(scope: !850, file: !819, line: 18, column: 5)
!850 = distinct !DILexicalBlock(scope: !839, file: !819, line: 18, column: 5)
!851 = !DILocation(line: 19, column: 13, scope: !848, inlinedAt: !845)
!852 = !DILocation(line: 57, column: 18, scope: !674, inlinedAt: !724)
!853 = !DILocation(line: 57, column: 16, scope: !674, inlinedAt: !724)
!854 = !{!772, !773, i64 10}
!855 = !DILocation(line: 0, scope: !667, inlinedAt: !723)
!856 = !DILocation(line: 20, column: 5, scope: !667, inlinedAt: !723)
!857 = !DILocation(line: 22, column: 29, scope: !667, inlinedAt: !723)
!858 = !DILocation(line: 22, column: 5, scope: !667, inlinedAt: !723)
!859 = !DILocation(line: 23, column: 5, scope: !667, inlinedAt: !723)
!860 = !DILocation(line: 24, column: 5, scope: !667, inlinedAt: !723)
!861 = !DILocation(line: 26, column: 1, scope: !667, inlinedAt: !723)
!862 = !DILocation(line: 218, column: 9, scope: !706, inlinedAt: !725)
!863 = !DILocation(line: 225, column: 13, scope: !864, inlinedAt: !725)
!864 = distinct !DILexicalBlock(scope: !708, file: !533, line: 225, column: 9)
!865 = !DILocation(line: 225, column: 17, scope: !864, inlinedAt: !725)
!866 = !DILocation(line: 225, column: 9, scope: !708, inlinedAt: !725)
!867 = !DILocation(line: 228, column: 14, scope: !868, inlinedAt: !725)
!868 = distinct !DILexicalBlock(scope: !708, file: !533, line: 228, column: 9)
!869 = !DILocation(line: 228, column: 18, scope: !868, inlinedAt: !725)
!870 = !DILocation(line: 228, column: 9, scope: !708, inlinedAt: !725)
!871 = !DILocation(line: 231, column: 29, scope: !708, inlinedAt: !725)
!872 = !DILocation(line: 231, column: 22, scope: !708, inlinedAt: !725)
!873 = !DILocation(line: 232, column: 11, scope: !708, inlinedAt: !725)
!874 = !DILocation(line: 232, column: 17, scope: !708, inlinedAt: !725)
!875 = !{!777, !738, i64 44}
!876 = !DILocation(line: 233, column: 27, scope: !708, inlinedAt: !725)
!877 = !DILocation(line: 233, column: 16, scope: !708, inlinedAt: !725)
!878 = !DILocation(line: 233, column: 20, scope: !708, inlinedAt: !725)
!879 = !{!738, !738, i64 0}
!880 = !DILocation(line: 234, column: 27, scope: !708, inlinedAt: !725)
!881 = !DILocation(line: 140, column: 17, scope: !717, inlinedAt: !726)
!882 = !DILocation(line: 145, column: 35, scope: !883, inlinedAt: !726)
!883 = distinct !DILexicalBlock(scope: !718, file: !3, line: 144, column: 14)
!884 = !DILocation(line: 145, column: 24, scope: !883, inlinedAt: !726)
!885 = !DILocation(line: 145, column: 28, scope: !883, inlinedAt: !726)
!886 = !DILocation(line: 146, column: 35, scope: !883, inlinedAt: !726)
!887 = !DILocation(line: 490, column: 26, scope: !485, inlinedAt: !664)
!888 = !DILocation(line: 0, scope: !718, inlinedAt: !726)
!889 = !DILocation(line: 509, column: 9, scope: !485, inlinedAt: !664)
!890 = !DILocalVariable(name: "data", arg: 1, scope: !891, file: !52, line: 67, type: !44)
!891 = distinct !DISubprogram(name: "parse_tcp", scope: !52, file: !52, line: 67, type: !892, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !894)
!892 = !DISubroutineType(types: !893)
!893 = !{!454, !44, !44, !454, !456}
!894 = !{!890, !895, !896, !897, !898, !899, !900}
!895 = !DILocalVariable(name: "data_end", arg: 2, scope: !891, file: !52, line: 67, type: !44)
!896 = !DILocalVariable(name: "is_ipv6", arg: 3, scope: !891, file: !52, line: 67, type: !454)
!897 = !DILocalVariable(name: "pckt", arg: 4, scope: !891, file: !52, line: 67, type: !456)
!898 = !DILocalVariable(name: "is_icmp", scope: !891, file: !52, line: 68, type: !454)
!899 = !DILocalVariable(name: "off", scope: !891, file: !52, line: 69, type: !95)
!900 = !DILocalVariable(name: "tcp", scope: !891, file: !52, line: 70, type: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !903, line: 25, size: 160, elements: !904)
!903 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "")
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !902, file: !903, line: 26, baseType: !394, size: 16)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !902, file: !903, line: 27, baseType: !394, size: 16, offset: 16)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !902, file: !903, line: 28, baseType: !130, size: 32, offset: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !902, file: !903, line: 29, baseType: !130, size: 32, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !902, file: !903, line: 31, baseType: !46, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !902, file: !903, line: 32, baseType: !46, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !902, file: !903, line: 33, baseType: !46, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !902, file: !903, line: 34, baseType: !46, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !902, file: !903, line: 35, baseType: !46, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !902, file: !903, line: 36, baseType: !46, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !902, file: !903, line: 37, baseType: !46, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !902, file: !903, line: 38, baseType: !46, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !902, file: !903, line: 39, baseType: !46, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !902, file: !903, line: 40, baseType: !46, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !902, file: !903, line: 55, baseType: !394, size: 16, offset: 112)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !902, file: !903, line: 56, baseType: !574, size: 16, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !902, file: !903, line: 57, baseType: !394, size: 16, offset: 144)
!922 = !DILocation(line: 0, scope: !891, inlinedAt: !923)
!923 = distinct !DILocation(line: 510, column: 14, scope: !924, inlinedAt: !664)
!924 = distinct !DILexicalBlock(scope: !925, file: !3, line: 510, column: 13)
!925 = distinct !DILexicalBlock(scope: !926, file: !3, line: 509, column: 34)
!926 = distinct !DILexicalBlock(scope: !485, file: !3, line: 509, column: 9)
!927 = !DILocation(line: 68, column: 29, scope: !891, inlinedAt: !923)
!928 = !DILocation(line: 68, column: 45, scope: !891, inlinedAt: !923)
!929 = !DILocalVariable(name: "is_ipv6", arg: 1, scope: !930, file: !52, line: 31, type: !454)
!930 = distinct !DISubprogram(name: "calc_offset", scope: !52, file: !52, line: 31, type: !931, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !933)
!931 = !DISubroutineType(types: !932)
!932 = !{!95, !454, !454}
!933 = !{!929, !934, !935}
!934 = !DILocalVariable(name: "is_icmp", arg: 2, scope: !930, file: !52, line: 31, type: !454)
!935 = !DILocalVariable(name: "off", scope: !930, file: !52, line: 32, type: !95)
!936 = !DILocation(line: 0, scope: !930, inlinedAt: !937)
!937 = distinct !DILocation(line: 69, column: 17, scope: !891, inlinedAt: !923)
!938 = !DILocation(line: 33, column: 9, scope: !930, inlinedAt: !937)
!939 = !DILocation(line: 71, column: 16, scope: !891, inlinedAt: !923)
!940 = !DILocation(line: 72, column: 13, scope: !941, inlinedAt: !923)
!941 = distinct !DILexicalBlock(scope: !891, file: !52, line: 72, column: 9)
!942 = !DILocation(line: 72, column: 17, scope: !941, inlinedAt: !923)
!943 = !DILocation(line: 72, column: 9, scope: !891, inlinedAt: !923)
!944 = !DILocation(line: 75, column: 14, scope: !945, inlinedAt: !923)
!945 = distinct !DILexicalBlock(scope: !891, file: !52, line: 75, column: 9)
!946 = !DILocation(line: 75, column: 9, scope: !945, inlinedAt: !923)
!947 = !DILocation(line: 75, column: 9, scope: !891, inlinedAt: !923)
!948 = !DILocation(line: 76, column: 21, scope: !949, inlinedAt: !923)
!949 = distinct !DILexicalBlock(scope: !945, file: !52, line: 75, column: 19)
!950 = !DILocation(line: 77, column: 5, scope: !949, inlinedAt: !923)
!951 = !DILocation(line: 78, column: 9, scope: !891, inlinedAt: !923)
!952 = !DILocation(line: 79, column: 37, scope: !953, inlinedAt: !923)
!953 = distinct !DILexicalBlock(scope: !954, file: !52, line: 78, column: 19)
!954 = distinct !DILexicalBlock(scope: !891, file: !52, line: 78, column: 9)
!955 = !{!956, !773, i64 0}
!956 = !{!"tcphdr", !773, i64 0, !773, i64 2, !737, i64 4, !737, i64 8, !773, i64 12, !773, i64 12, !773, i64 13, !773, i64 13, !773, i64 13, !773, i64 13, !773, i64 13, !773, i64 13, !773, i64 13, !773, i64 13, !773, i64 14, !773, i64 16, !773, i64 18}
!957 = !DILocation(line: 79, column: 20, scope: !953, inlinedAt: !923)
!958 = !DILocation(line: 79, column: 9, scope: !953, inlinedAt: !923)
!959 = !DILocation(line: 79, column: 30, scope: !953, inlinedAt: !923)
!960 = !DILocation(line: 80, column: 37, scope: !953, inlinedAt: !923)
!961 = !DILocation(line: 81, column: 5, scope: !953, inlinedAt: !923)
!962 = !DILocation(line: 83, column: 37, scope: !963, inlinedAt: !923)
!963 = distinct !DILexicalBlock(scope: !954, file: !52, line: 82, column: 10)
!964 = !{!956, !773, i64 2}
!965 = !DILocation(line: 83, column: 20, scope: !963, inlinedAt: !923)
!966 = !DILocation(line: 83, column: 9, scope: !963, inlinedAt: !923)
!967 = !DILocation(line: 83, column: 30, scope: !963, inlinedAt: !923)
!968 = !DILocalVariable(name: "data", arg: 1, scope: !969, file: !52, line: 48, type: !44)
!969 = distinct !DISubprogram(name: "parse_udp", scope: !52, file: !52, line: 48, type: !892, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !970)
!970 = !{!968, !971, !972, !973, !974, !975, !976}
!971 = !DILocalVariable(name: "data_end", arg: 2, scope: !969, file: !52, line: 48, type: !44)
!972 = !DILocalVariable(name: "is_ipv6", arg: 3, scope: !969, file: !52, line: 48, type: !454)
!973 = !DILocalVariable(name: "pckt", arg: 4, scope: !969, file: !52, line: 48, type: !456)
!974 = !DILocalVariable(name: "is_icmp", scope: !969, file: !52, line: 49, type: !454)
!975 = !DILocalVariable(name: "off", scope: !969, file: !52, line: 50, type: !95)
!976 = !DILocalVariable(name: "udp", scope: !969, file: !52, line: 51, type: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !979, line: 23, size: 64, elements: !980)
!979 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "")
!980 = !{!981, !982, !983, !984}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !978, file: !979, line: 24, baseType: !394, size: 16)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !978, file: !979, line: 25, baseType: !394, size: 16, offset: 16)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !978, file: !979, line: 26, baseType: !394, size: 16, offset: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !978, file: !979, line: 27, baseType: !574, size: 16, offset: 48)
!985 = !DILocation(line: 0, scope: !969, inlinedAt: !986)
!986 = distinct !DILocation(line: 515, column: 14, scope: !987, inlinedAt: !664)
!987 = distinct !DILexicalBlock(scope: !988, file: !3, line: 515, column: 13)
!988 = distinct !DILexicalBlock(scope: !989, file: !3, line: 514, column: 39)
!989 = distinct !DILexicalBlock(scope: !926, file: !3, line: 514, column: 14)
!990 = !DILocation(line: 49, column: 45, scope: !969, inlinedAt: !986)
!991 = !DILocation(line: 0, scope: !930, inlinedAt: !992)
!992 = distinct !DILocation(line: 50, column: 17, scope: !969, inlinedAt: !986)
!993 = !DILocation(line: 33, column: 9, scope: !930, inlinedAt: !992)
!994 = !DILocation(line: 52, column: 16, scope: !969, inlinedAt: !986)
!995 = !DILocation(line: 53, column: 13, scope: !996, inlinedAt: !986)
!996 = distinct !DILexicalBlock(scope: !969, file: !52, line: 53, column: 9)
!997 = !DILocation(line: 53, column: 17, scope: !996, inlinedAt: !986)
!998 = !DILocation(line: 53, column: 9, scope: !969, inlinedAt: !986)
!999 = !DILocation(line: 56, column: 9, scope: !969, inlinedAt: !986)
!1000 = !DILocation(line: 57, column: 37, scope: !1001, inlinedAt: !986)
!1001 = distinct !DILexicalBlock(scope: !1002, file: !52, line: 56, column: 19)
!1002 = distinct !DILexicalBlock(scope: !969, file: !52, line: 56, column: 9)
!1003 = !{!1004, !773, i64 0}
!1004 = !{!"udphdr", !773, i64 0, !773, i64 2, !773, i64 4, !773, i64 6}
!1005 = !DILocation(line: 57, column: 20, scope: !1001, inlinedAt: !986)
!1006 = !DILocation(line: 57, column: 9, scope: !1001, inlinedAt: !986)
!1007 = !DILocation(line: 57, column: 30, scope: !1001, inlinedAt: !986)
!1008 = !DILocation(line: 58, column: 37, scope: !1001, inlinedAt: !986)
!1009 = !DILocation(line: 59, column: 5, scope: !1001, inlinedAt: !986)
!1010 = !DILocation(line: 61, column: 37, scope: !1011, inlinedAt: !986)
!1011 = distinct !DILexicalBlock(scope: !1002, file: !52, line: 60, column: 10)
!1012 = !{!1004, !773, i64 2}
!1013 = !DILocation(line: 61, column: 20, scope: !1011, inlinedAt: !986)
!1014 = !DILocation(line: 61, column: 9, scope: !1011, inlinedAt: !986)
!1015 = !DILocation(line: 61, column: 30, scope: !1011, inlinedAt: !986)
!1016 = !DILocation(line: 0, scope: !926, inlinedAt: !664)
!1017 = !DILocation(line: 536, column: 13, scope: !1018, inlinedAt: !664)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 535, column: 10)
!1019 = distinct !DILexicalBlock(scope: !485, file: !3, line: 532, column: 9)
!1020 = !DILocation(line: 536, column: 17, scope: !1018, inlinedAt: !664)
!1021 = !DILocation(line: 538, column: 26, scope: !485, inlinedAt: !664)
!1022 = !DILocation(line: 538, column: 16, scope: !485, inlinedAt: !664)
!1023 = !DILocation(line: 538, column: 9, scope: !485, inlinedAt: !664)
!1024 = !DILocation(line: 538, column: 14, scope: !485, inlinedAt: !664)
!1025 = !{!1026, !773, i64 16}
!1026 = !{!"vip_definition", !738, i64 0, !773, i64 16, !738, i64 18}
!1027 = !DILocation(line: 539, column: 9, scope: !485, inlinedAt: !664)
!1028 = !DILocation(line: 539, column: 15, scope: !485, inlinedAt: !664)
!1029 = !{!1026, !738, i64 18}
!1030 = !DILocation(line: 540, column: 16, scope: !485, inlinedAt: !664)
!1031 = !DILocation(line: 541, column: 10, scope: !1032, inlinedAt: !664)
!1032 = distinct !DILexicalBlock(scope: !485, file: !3, line: 541, column: 9)
!1033 = !DILocation(line: 541, column: 9, scope: !485, inlinedAt: !664)
!1034 = !DILocation(line: 542, column: 18, scope: !1035, inlinedAt: !664)
!1035 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 541, column: 20)
!1036 = !DILocation(line: 543, column: 20, scope: !1035, inlinedAt: !664)
!1037 = !DILocation(line: 544, column: 14, scope: !1038, inlinedAt: !664)
!1038 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 544, column: 13)
!1039 = !DILocation(line: 544, column: 13, scope: !1035, inlinedAt: !664)
